TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_m0p_mspm33c321x__include
#define ti_devices_msp_m0p_mspm33c321x__include

/* Filename: m33c1.h */
/* Revised: 2024-09-20 11:27:33*/

/* Use standard integer types with explicit width */
#include <stdbool.h>
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup M33C1_Definitions M33C1 Definitions
  This file defines all structures and symbols for M33C1
  @{
*/

/** @addtogroup M33C1_CMSIS Device CMSIS Definitions
  Configuration of the Processor and Core Peripherals
  @{
*/
/******************************************************************************
 * Interrupt Definitions                                                       *
 ******************************************************************************/
typedef enum IRQn {
    NonMaskableInt_IRQn        = -14, /* 2  Non Maskable Interrupt */
    HardFault_IRQn             = -13, /* 3  Hard Fault Interrupt */
    SVCall_IRQn                = -5,  /* 11 SV Call Interrupt */
    PendSV_IRQn                = -2,  /* 14 Pend SV Interrupt */
    SysTick_IRQn               = -1,  /* 15 System Tick Interrupt */
    SYSCTL_INT_IRQn            = 0,   /* 16 SYSCTL_INT Interrupt */
    DEBUGSS_INT_IRQn           = 1,   /* 17 DEBUGSS_INT Interrupt */
    FLASHCTL_INT_IRQn          = 2,   /* 18 FLASHCTL_INT Interrupt */
    WWDT0_INT_IRQn             = 3,   /* 19 WWDT0_INT Interrupt */
    GPIOA_INT_IRQn             = 6,   /* 22 GPIOA_INT Interrupt */
    GPIOB_INT_IRQn             = 7,   /* 23 GPIOB_INT Interrupt */
    GPIOC_INT_IRQn             = 8,   /* 24 GPIOC_INT Interrupt */
    ADC0_INT_PUB1_INT_IRQn     = 9,   /* 25 ADC0_INT_PUB1_INT Interrupt */
    ADC0_INT_PUB2_INT_IRQn     = 10,  /* 26 ADC0_INT_PUB2_INT Interrupt */
    ADC0_INT_PUB3_INT_IRQn     = 11,  /* 27 ADC0_INT_PUB3_INT Interrupt */
    ADC0_INT_PUB4_INT_IRQn     = 12,  /* 28 ADC0_INT_PUB4_INT Interrupt */
    ADC0_EVT_INT_PUB1_INT_IRQn = 13,  /* 29 ADC0_EVT_INT_PUB1_INT Interrupt */
    ADC1_INT_PUB1_INT_IRQn     = 14,  /* 30 ADC1_INT_PUB1_INT Interrupt */
    ADC1_INT_PUB2_INT_IRQn     = 15,  /* 31 ADC1_INT_PUB2_INT Interrupt */
    ADC1_INT_PUB3_INT_IRQn     = 16,  /* 32 ADC1_INT_PUB3_INT Interrupt */
    ADC1_INT_PUB4_INT_IRQn     = 17,  /* 33 ADC1_INT_PUB4_INT Interrupt */
    ADC1_EVT_INT_PUB1_INT_IRQn = 18,  /* 34 ADC1_EVT_INT_PUB1_INT Interrupt */
    CANFD0_INT_IRQn            = 19,  /* 35 CANFD0_INT Interrupt */
    TIMA0_0_INT_IRQn           = 20,  /* 36 TIMA0_0_INT Interrupt */
    TIMG4_0_INT_IRQn           = 21,  /* 37 TIMG4_0_INT Interrupt */
    TIMG4_1_INT_IRQn           = 22,  /* 38 TIMG4_1_INT Interrupt */
    TIMG8_0_INT_IRQn           = 23,  /* 39 TIMG8_0_INT Interrupt */
    TIMG12_0_INT_IRQn          = 24,  /* 40 TIMG12_0_INT Interrupt */
    UC0_INT_IRQn               = 25,  /* 41 UC0_INT Interrupt */
    UC1_INT_IRQn               = 26,  /* 42 UC1_INT Interrupt */
    UC2_INT_IRQn               = 27,  /* 43 UC2_INT Interrupt */
    UC3_INT_IRQn               = 28,  /* 44 UC3_INT Interrupt */
    UC4_INT_IRQn               = 29,  /* 45 UC4_INT Interrupt */
    UC5_INT_IRQn               = 30,  /* 46 UC5_INT Interrupt */
    UC6_INT_IRQn               = 31,  /* 47 UC6_INT Interrupt */
    UC10_INT_IRQn              = 32,  /* 48 UC10_INT Interrupt */
    CANFD1_INT_IRQn            = 33,  /* 49 CANFD1_INT Interrupt */
    TIMA0_1_INT_IRQn           = 34,  /* 50 TIMA0_1_INT Interrupt */
    TIMG4_2_INT_IRQn           = 35,  /* 51 TIMG4_2_INT Interrupt */
    TIMG4_3_INT_IRQn           = 36,  /* 52 TIMG4_3_INT Interrupt */
    TIMG8_1_INT_IRQn           = 37,  /* 53 TIMG8_1_INT Interrupt */
    COMP0_INT_IRQn             = 38,  /* 54 COMP0_INT Interrupt */
    COMP1_INT_IRQn             = 39,  /* 55 COMP1_INT Interrupt */
    TRNG_INT_IRQn              = 40,  /* 56 TRNG_INT Interrupt */
    AESADV_INT_IRQn            = 41,  /* 57 AESADV_INT Interrupt */
    LFSS_INT_IRQn              = 42,  /* 58 LFSS_INT Interrupt */
    DMA0_INT_IRQn              = 43,  /* 59 DMA0_INT Interrupt */
    DMA1_INT_IRQn              = 44,  /* 60 DMA1_INT Interrupt */
    I2S0_INT_IRQn              = 45,  /* 61 I2S0_INT Interrupt */
    I2S1_INT_IRQn              = 46,  /* 62 I2S1_INT Interrupt */
    QSPI_INT_IRQn              = 47,  /* 63 QSPI_INT Interrupt */
    SHAW_INT_IRQn              = 48,  /* 64 SHAW_INT Interrupt */
    PKA_INT_IRQn               = 49,  /* 65 PKA_INT Interrupt */
    UC7_INT_IRQn               = 50,  /* 66 UC7_INT Interrupt */
    UC8_INT_IRQn               = 51,  /* 67 UC8_INT Interrupt */
    UC9_INT_IRQn               = 52,  /* 68 UC9_INT Interrupt */
} IRQn_Type;

#define NonMaskableInt_VECn        2  /* Non Maskable Interrupt */
#define HardFault_VECn             3  /* Hard Fault Interrupt */
#define SVCall_VECn                11 /* SV Call Interrupt */
#define PendSV_VECn                14 /* Pend SV Interrupt */
#define SysTick_VECn               15 /* System Tick Interrupt */
#define SYSCTL_INT_VECn            16 /* SYSCTL_INT Interrupt */
#define DEBUGSS_INT_VECn           17 /* DEBUGSS_INT Interrupt */
#define FLASHCTL_INT_VECn          18 /* FLASHCTL_INT Interrupt */
#define WWDT0_INT_VECn             19 /* WWDT0_INT Interrupt */
#define GPIOA_INT_VECn             22 /* GPIOA_INT Interrupt */
#define GPIOB_INT_VECn             23 /* GPIOB_INT Interrupt */
#define GPIOC_INT_VECn             24 /* GPIOC_INT Interrupt */
#define ADC0_INT_PUB1_INT_VECn     25 /* ADC0_INT_PUB1_INT Interrupt */
#define ADC0_INT_PUB2_INT_VECn     26 /* ADC0_INT_PUB2_INT Interrupt */
#define ADC0_INT_PUB3_INT_VECn     27 /* ADC0_INT_PUB3_INT Interrupt */
#define ADC0_INT_PUB4_INT_VECn     28 /* ADC0_INT_PUB4_INT Interrupt */
#define ADC0_EVT_INT_PUB1_INT_VECn 29 /* ADC0_EVT_INT_PUB1_INT Interrupt */
#define ADC1_INT_PUB1_INT_VECn     30 /* ADC1_INT_PUB1_INT Interrupt */
#define ADC1_INT_PUB2_INT_VECn     31 /* ADC1_INT_PUB2_INT Interrupt */
#define ADC1_INT_PUB3_INT_VECn     32 /* ADC1_INT_PUB3_INT Interrupt */
#define ADC1_INT_PUB4_INT_VECn     33 /* ADC1_INT_PUB4_INT Interrupt */
#define ADC1_EVT_INT_PUB1_INT_VECn 34 /* ADC1_EVT_INT_PUB1_INT Interrupt */
#define CANFD0_INT_VECn            35 /* CANFD0_INT Interrupt */
#define TIMA0_0_INT_VECn           36 /* TIMA0_0_INT Interrupt */
#define TIMG4_0_INT_VECn           37 /* TIMG4_0_INT Interrupt */
#define TIMG4_1_INT_VECn           38 /* TIMG4_1_INT Interrupt */
#define TIMG8_0_INT_VECn           39 /* TIMG8_0_INT Interrupt */
#define TIMG12_0_INT_VECn          40 /* TIMG12_0_INT Interrupt */
#define UC0_INT_VECn               41 /* UC0_INT Interrupt */
#define UC1_INT_VECn               42 /* UC1_INT Interrupt */
#define UC2_INT_VECn               43 /* UC2_INT Interrupt */
#define UC3_INT_VECn               44 /* UC3_INT Interrupt */
#define UC4_INT_VECn               45 /* UC4_INT Interrupt */
#define UC5_INT_VECn               46 /* UC5_INT Interrupt */
#define UC6_INT_VECn               47 /* UC6_INT Interrupt */
#define UC10_INT_VECn              48 /* UC10_INT Interrupt */
#define CANFD1_INT_VECn            49 /* CANFD1_INT Interrupt */
#define TIMA0_1_INT_VECn           50 /* TIMA0_1_INT Interrupt */
#define TIMG4_2_INT_VECn           51 /* TIMG4_2_INT Interrupt */
#define TIMG4_3_INT_VECn           52 /* TIMG4_3_INT Interrupt */
#define TIMG8_1_INT_VECn           53 /* TIMG8_1_INT Interrupt */
#define COMP0_INT_VECn             54 /* COMP0_INT Interrupt */
#define COMP1_INT_VECn             55 /* COMP1_INT Interrupt */
#define TRNG_INT_VECn              56 /* TRNG_INT Interrupt */
#define AESADV_INT_VECn            57 /* AESADV_INT Interrupt */
#define LFSS_INT_VECn              58 /* LFSS_INT Interrupt */
#define DMA0_INT_VECn              59 /* DMA0_INT Interrupt */
#define DMA1_INT_VECn              60 /* DMA1_INT Interrupt */
#define I2S0_INT_VECn              61 /* I2S0_INT Interrupt */
#define I2S1_INT_VECn              62 /* I2S1_INT Interrupt */
#define QSPI_INT_VECn              63 /* QSPI_INT Interrupt */
#define SHAW_INT_VECn              64 /* SHAW_INT Interrupt */
#define PKA_INT_VECn               65 /* PKA_INT Interrupt */
#define UC7_INT_VECn               66 /* UC7_INT Interrupt */
#define UC8_INT_VECn               67 /* UC8_INT Interrupt */
#define UC9_INT_VECn               68 /* UC9_INT Interrupt */

