TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/******************************************************************************
 * Ignore unused variables                                                     *
 ******************************************************************************/

#if defined(__CC_ARM)
#pragma push
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language = extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
#pragma warning 586
#elif defined(__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/******************************************************************************
 * Processor and Core Peripheral Section                                       *
 ******************************************************************************/

#define __CM33_REV             0x0001U /* Core revision r0p1 */
#define __MPU_PRESENT          0x0001U /* MPU present */
#define __FPU_PRESENT          0x0001U /* FPU present */
#define __DSP_PRESENT          0x0001U /* DSP present */
#define __VTOR_PRESENT         0x0001U /* VTOR present */
#define __NVIC_PRIO_BITS       0x0002U /* Number of bits used for Priority Levels */
#define __Vendor_SysTickConfig 0x0000U /* Set to 1 if different SysTick Config is used */

#include "core_cm33.h" /* Processor and core peripherals */

/******************************************************************************
 * Peripheral headers                                                          *
 ******************************************************************************/
/** @addtogroup M33C1_Peripherals M33C1 Peripherals
  M33C1 Peripheral registers structures
  @{
*/

#include <ti/devices/msp/peripherals/hw_aesadvhp.h>
#include <ti/devices/msp/peripherals/hw_comp.h>
#include <ti/devices/msp/peripherals/hw_crcp.h>
#include <ti/devices/msp/peripherals/hw_dma.h>
#include <ti/devices/msp/peripherals/hw_flashctl.h>
#include <ti/devices/msp/peripherals/hw_fri.h>
#include <ti/devices/msp/peripherals/hw_gpio.h>
#include <ti/devices/msp/peripherals/hw_gptimer.h>
#include <ti/devices/msp/peripherals/hw_gsc.h>
#include <ti/devices/msp/peripherals/hw_hsadc.h>
#include <ti/devices/msp/peripherals/hw_i2s.h>
#include <ti/devices/msp/peripherals/hw_iomux.h>
#include <ti/devices/msp/peripherals/hw_keystorectl.h>
#include <ti/devices/msp/peripherals/hw_lfss.h>
#include <ti/devices/msp/peripherals/hw_mcan.h>
#include <ti/devices/msp/peripherals/hw_memcfg.h>
#include <ti/devices/msp/peripherals/hw_pka.h>
#include <ti/devices/msp/peripherals/hw_qspi.h>
#include <ti/devices/msp/peripherals/hw_rtc.h>
#include <ti/devices/msp/peripherals/hw_shaw.h>
#include <ti/devices/msp/peripherals/hw_spgss.h>
// #include <ti/devices/msp/peripherals/hw_spgss0.h>
#include <ti/devices/msp/peripherals/hw_trng.h>
#include <ti/devices/msp/peripherals/hw_unicomm.h>
#include <ti/devices/msp/peripherals/hw_unicommi2cc.h>
#include <ti/devices/msp/peripherals/hw_unicommi2ct.h>
#include <ti/devices/msp/peripherals/hw_unicommspi.h>
#include <ti/devices/msp/peripherals/hw_unicommuart.h>
#include <ti/devices/msp/peripherals/hw_vref.h>
#include <ti/devices/msp/peripherals/hw_wuc.h>
#include <ti/devices/msp/peripherals/hw_wwdt.h>
#include <ti/devices/msp/peripherals/m33/hw_debugss.h>
#include <ti/devices/msp/peripherals/m33/hw_factoryregion.h>
#include <ti/devices/msp/peripherals/m33/hw_sysctl.h>
#include <ti/devices/msp/peripherals/m33/hw_eam.h>

/*@}*/ /* end of group M33C1_Peripherals */

/******************************************************************************
 * Device and peripheral memory map for Non-Secure Space.                                         *
 ******************************************************************************/
/** @addtogroup M33C1_MemoryMap M33C1 Memory Mapping
  @{
*/

#define TRNG_BASE                      (0x40044000U) /*!< Base address of module TRNG */
#define WWDT0_BASE                     (0x400D0000U) /*!< Base address of module WWDT0 */
#define CRCP0_BASE                     (0x401B2000U) /*!< Base address of module CRCP0 */
#define LFSS_BASE                      (0x400D8000U) /*!< Base address of module LFSS */
#define RTC_BASE                       (0x400D8000U) /*!< Base address of module RTC */
#define RTC_A_BASE                     (0x400D8000U) /*!< Base address of module RTC_A */
#define RTC_B_BASE                     (0x400D8000U) /*!< Base address of module RTC_B */
#define GPIOA_BASE                     (0x400F0000U) /*!< Base address of module GPIOA */
#define GPIOB_BASE                     (0x400F2000U) /*!< Base address of module GPIOB */
#define GPIOC_BASE                     (0x400F4000U) /*!< Base address of module GPIOC */
#define DEBUGSS_BASE                   (0x400C7000U) /*!< Base address of module DEBUGSS */
#define AESADV_BASE                    (0x401B0000U) /*!< Base address of module AESADV */
#define WUC_BASE                       (0x40424000U) /*!< Base address of module WUC */
#define KEYSTORECTL_BASE               (0x401B6000U) /*!< Base address of module KEYSTORECTL */
#define I2S0_BASE                      (0x401A0000U) /*!< Base address of module I2S0 */
#define I2S1_BASE                      (0x401A2000U) /*!< Base address of module I2S1 */
#define TIMA0_1_BASE                   (0x40012000U) /*!< Base address of module TIMA0_1 */
#define TIMA0_0_BASE                   (0x40010000U) /*!< Base address of module TIMA0_0 */
#define TIMG4_0_BASE                   (0x400C0000U) /*!< Base address of module TIMG4_0 */
#define TIMG4_1_BASE                   (0x400C2000U) /*!< Base address of module TIMG4_1 */
#define TIMG4_2_BASE                   (0x40180000U) /*!< Base address of module TIMG4_2 */
#define TIMG4_3_BASE                   (0x40182000U) /*!< Base address of module TIMG4_3 */
#define TIMG8_0_BASE                   (0x40184000U) /*!< Base address of module TIMG8_0 */
#define TIMG8_1_BASE                   (0x40186000U) /*!< Base address of module TIMG8_1 */
#define TIMG12_0_BASE                  (0x40188000U) /*!< Base address of module TIMG12_0 */
#define FLASHCTL_BASE                  (0x40042000U) /*!< Base address of module FLASHCTL */
#define IOMUX_BASE                     (0x400CC000U) /*!< Base address of module IOMUX */
#define QSPI_BASE                      (0x40032000U) /*!< Base address of module QSPI */
#define SYSCTL_BASE                    (0x400AF000U) /*!< Base address of module SYSCTL */
#define COMP0_BASE                     (0x400E0000U) /*!< Base address of module COMP0 */
#define UC0_UART_BASE                  (0x40502000U) /*!< Base address of module UC0_UART */
#define UC1_UART_BASE                  (0x40504000U) /*!< Base address of module UC1_UART */
#define UC0_I2CC_BASE                  (0x40522000U) /*!< Base address of module UC0_I2CC */
#define UC1_I2CC_BASE                  (0x40524000U) /*!< Base address of module UC1_I2CC */
#define UC0_I2CT_BASE                  (0x40542000U) /*!< Base address of module UC0_I2CT */
#define UC1_I2CT_BASE                  (0x40544000U) /*!< Base address of module UC1_I2CT */
#define UC0_BASE                       (0x40582000U) /*!< Base address of module UC0 */
#define UC1_BASE                       (0x40584000U) /*!< Base address of module UC1 */
#define SPG0_BASE                      (0x4059F000U) /*!< Base address of module SPG0 */
#define UC5_UART_BASE                  (0x40608000U) /*!< Base address of module UC5_UART */
#define UC6_UART_BASE                  (0x4060A000U) /*!< Base address of module UC6_UART */
#define UC3_I2CC_BASE                  (0x40624000U) /*!< Base address of module UC3_I2CC */
#define UC4_I2CC_BASE                  (0x40626000U) /*!< Base address of module UC4_I2CC */
#define UC6_I2CC_BASE                  (0x4062A000U) /*!< Base address of module UC6_I2CC */
#define UC3_I2CT_BASE                  (0x40644000U) /*!< Base address of module UC3_I2CT */
#define UC4_I2CT_BASE                  (0x40646000U) /*!< Base address of module UC4_I2CT */
#define UC6_I2CT_BASE                  (0x4064A000U) /*!< Base address of module UC6_I2CT */
#define UC2_SPI_BASE                   (0x40660000U) /*!< Base address of module UC2_SPI */
#define UC6_SPI_BASE                   (0x4066A000U) /*!< Base address of module UC6_SPI */
#define UC2_BASE                       (0x40680000U) /*!< Base address of module UC2 */
#define UC3_BASE                       (0x40684000U) /*!< Base address of module UC3 */
#define UC4_BASE                       (0x40686000U) /*!< Base address of module UC4 */
#define UC5_BASE                       (0x40688000U) /*!< Base address of module UC5 */
#define UC6_BASE                       (0x4068A000U) /*!< Base address of module UC6 */
#define SPG1_BASE                      (0x4069F000U) /*!< Base address of module SPG1 */
#define UC7_UART_BASE                  (0x40700000U) /*!< Base address of module UC7_UART */
#define UC8_UART_BASE                  (0x40702000U) /*!< Base address of module UC8_UART */
#define UC9_UART_BASE                  (0x40704000U) /*!< Base address of module UC9_UART */
#define UC10_UART_BASE                 (0x40706000U) /*!< Base address of module UC10_UART */
#define UC7_I2CC_BASE                  (0x40720000U) /*!< Base address of module UC7_I2CC */
#define UC8_I2CC_BASE                  (0x40722000U) /*!< Base address of module UC8_I2CC */
#define UC9_I2CC_BASE                  (0x40724000U) /*!< Base address of module UC9_I2CC */
#define UC10_I2CC_BASE                 (0x40726000U) /*!< Base address of module UC10_I2CC */
#define UC7_I2CT_BASE                  (0x40740000U) /*!< Base address of module UC7_I2CT */
#define UC8_I2CT_BASE                  (0x40742000U) /*!< Base address of module UC8_I2CT */
#define UC9_I2CT_BASE                  (0x40744000U) /*!< Base address of module UC9_I2CT */
#define UC10_I2CT_BASE                 (0x40746000U) /*!< Base address of module UC10_I2CT */
#define UC7_SPI_BASE                   (0x40760000U) /*!< Base address of module UC7_SPI */
#define UC8_SPI_BASE                   (0x40762000U) /*!< Base address of module UC8_SPI */
#define UC9_SPI_BASE                   (0x40764000U) /*!< Base address of module UC9_SPI */
#define UC7_BASE                       (0x40780000U) /*!< Base address of module UC7 */
#define UC8_BASE                       (0x40782000U) /*!< Base address of module UC8 */
#define UC9_BASE                       (0x40784000U) /*!< Base address of module UC9 */
#define UC10_BASE                      (0x40786000U) /*!< Base address of module UC10 */
#define SPG2_BASE                      (0x4079F000U) /*!< Base address of module SPG2 */
#define GSC_BASE                       (0x50046000U) /*!< Base address of module GSC */
#define FACTORYREGION_BASE             (0x80111000U) /*!< Base address of module FACTORYREGION */
#define EAM_BASE                       (0x4002C000U) /*!< Base address of module EAM */
#define CANFD0_BASE                    (0x40110000U) /*!< Base address of module CANFD0 */
#define CANFD1_BASE                    (0x40118000U) /*!< Base address of module CANFD1 */
#define MEMCFG_BASE                    (0x4002A000U) /*!< Base address of module MEMCFG */
#define DMA0_BASE                      (0x40020000U) /*!< Base address of module DMA0 */
#define DMA1_BASE                      (0x40022000U) /*!< Base address of module DMA1 */
#define PKA_BASE                       (0x401C0000U) /*!< Base address of module PKA */
#define VREF_BASE                      (0x400E8000U) /*!< Base address of module VREF */
#define ADC0_ADC_LITE_REGS_BASE        (0x40000000U) /*!< Base address of module ADC0_ADC_LITE_REGS */
#define ADC0_ADC_LITE_RESULT_REGS_BASE (0x40004000U) /*!< Base address of module ADC0_ADC_LITE_RESULT_REGS */
#define ADC1_ADC_LITE_REGS_BASE        (0x40002000U) /*!< Base address of module ADC1_ADC_LITE_REGS */
#define ADC1_ADC_LITE_RESULT_REGS_BASE (0x40006000U) /*!< Base address of module ADC1_ADC_LITE_RESULT_REGS */
#define COMP1_BASE                     (0x400E2000U) /*!< Base address of module COMP1 */
#define FRI_BASE                       (0x40028000U) /*!< Base address of module FRI */
#define SHAW_BASE                      (0x401B4000U) /*!< Base address of module SHAW */
#define DFTSS_BASE                     (0x40034000U) /*!< Base address of module DFTSS */

