TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
typedef struct {
    UNICOMM_Regs         * const inst;
    UNICOMMUART_Regs     * const uart;
    UNICOMMI2CC_Regs     * const i2cc;
    UNICOMMI2CT_Regs     * const i2ct;
    UNICOMMSPI_Regs      * const spi;
    bool                   const fixedMode;
} UNICOMM_Inst_Regs;

static const UNICOMM_Inst_Regs UC0_Inst = {
    .inst      = (UNICOMM_Regs *) UC0_BASE,
    .uart      = (UNICOMMUART_Regs *) UC0_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC0_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC0_I2CT_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC1_Inst = {
    .inst      = (UNICOMM_Regs *) UC1_BASE,
    .uart      = (UNICOMMUART_Regs *) UC1_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC1_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC1_I2CT_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC2_Inst = {
    .inst      = (UNICOMM_Regs *) UC2_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC2_SPI_BASE,
    .fixedMode = true
};
static const UNICOMM_Inst_Regs UC3_Inst = {
    .inst      = (UNICOMM_Regs *) UC3_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC3_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC3_I2CT_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC4_Inst = {
    .inst      = (UNICOMM_Regs *) UC4_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC4_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC4_I2CT_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC5_Inst = {
    .inst      = (UNICOMM_Regs *) UC5_BASE,
    .uart      = (UNICOMMUART_Regs *) UC5_UART_BASE,
    .fixedMode = true
};
static const UNICOMM_Inst_Regs UC6_Inst = {
    .inst      = (UNICOMM_Regs *) UC6_BASE,
    .uart      = (UNICOMMUART_Regs *) UC6_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC6_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC6_I2CT_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC6_SPI_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC7_Inst = {
    .inst      = (UNICOMM_Regs *) UC7_BASE,
    .uart      = (UNICOMMUART_Regs *) UC7_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC7_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC7_I2CT_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC7_SPI_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC8_Inst = {
    .inst      = (UNICOMM_Regs *) UC8_BASE,
    .uart      = (UNICOMMUART_Regs *) UC8_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC8_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC8_I2CT_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC8_SPI_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC9_Inst = {
    .inst      = (UNICOMM_Regs *) UC9_BASE,
    .uart      = (UNICOMMUART_Regs *) UC9_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC9_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC9_I2CT_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC9_SPI_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC10_Inst = {
    .inst      = (UNICOMM_Regs *) UC10_BASE,
    .uart      = (UNICOMMUART_Regs *) UC10_UART_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC10_I2CC_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC10_I2CT_BASE,
    .fixedMode = false
};
/******************************************************************************
 * Device and peripheral memory map for Secure Space.                                         *
 ******************************************************************************/
/** @addtogroup M33C1_MemoryMap M33C1 Memory Mapping
  @{
*/

#define TRNG_BASE_S                      (0x50044000U) /*!< Base address of module TRNG */
#define WWDT0_BASE_S                     (0x500D0000U) /*!< Base address of module WWDT0 */
#define CRCP0_BASE_S                     (0x501B2000U) /*!< Base address of module CRCP0 */
#define LFSS_BASE_S                      (0x500D8000U) /*!< Base address of module LFSS */
#define RTC_BASE_S                       (0x500D8000U) /*!< Base address of module RTC  */
#define RTC_A_BASE_S                     (0x500D8000U) /*!< Base address of module RTC_A */
#define RTC_B_BASE_S                     (0x500D8000U) /*!< Base address of module RTC_B */
#define GPIOA_BASE_S                     (0x500F0000U) /*!< Base address of module GPIOA */
#define GPIOB_BASE_S                     (0x500F2000U) /*!< Base address of module GPIOB */
#define GPIOC_BASE_S                     (0x500F4000U) /*!< Base address of module GPIOC */
#define DEBUGSS_BASE_S                   (0x500C7000U) /*!< Base address of module DEBUGSS */
#define AESADV_BASE_S                    (0x501B0000U) /*!< Base address of module AESADV */
#define WUC_BASE_S                       (0x50424000U) /*!< Base address of module WUC */
#define KEYSTORECTL_BASE_S               (0x501B6000U) /*!< Base address of module KEYSTORECTL */
#define I2S0_BASE_S                      (0x501A0000U) /*!< Base address of module I2S0 */
#define I2S1_BASE_S                      (0x501A2000U) /*!< Base address of module I2S1 */
#define TIMA0_1_BASE_S                   (0x50012000U) /*!< Base address of module TIMA0_1 */
#define TIMA0_0_BASE_S                   (0x50010000U) /*!< Base address of module TIMA0_0 */
#define TIMG4_0_BASE_S                   (0x500C0000U) /*!< Base address of module TIMG4_0 */
#define TIMG4_1_BASE_S                   (0x500C2000U) /*!< Base address of module TIMG4_1 */
#define TIMG4_2_BASE_S                   (0x50180000U) /*!< Base address of module TIMG4_2 */
#define TIMG4_3_BASE_S                   (0x50182000U) /*!< Base address of module TIMG4_3 */
#define TIMG8_0_BASE_S                   (0x50184000U) /*!< Base address of module TIMG8_0 */
#define TIMG8_1_BASE_S                   (0x50186000U) /*!< Base address of module TIMG8_1 */
#define TIMG12_0_BASE_S                  (0x50188000U) /*!< Base address of module TIMG12_0 */
#define FLASHCTL_BASE_S                  (0x50042000U) /*!< Base address of module FLASHCTL */
#define IOMUX_BASE_S                     (0x500CC000U) /*!< Base address of module IOMUX */
#define QSPI_BASE_S                      (0x50032000U) /*!< Base address of module QSPI */
#define SYSCTL_BASE_S                    (0x500AF000U) /*!< Base address of module SYSCTL */
#define COMP0_BASE_S                     (0x500E0000U) /*!< Base address of module COMP0 */
#define UC0_UART_BASE_S                  (0x50502000U) /*!< Base address of module UC0_UART */
#define UC1_UART_BASE_S                  (0x50504000U) /*!< Base address of module UC1_UART */
#define UC0_I2CC_BASE_S                  (0x50522000U) /*!< Base address of module UC0_I2CC */
#define UC1_I2CC_BASE_S                  (0x50524000U) /*!< Base address of module UC1_I2CC */
#define UC0_I2CT_BASE_S                  (0x50542000U) /*!< Base address of module UC0_I2CT */
#define UC1_I2CT_BASE_S                  (0x50544000U) /*!< Base address of module UC1_I2CT */
#define UC0_BASE_S                       (0x50582000U) /*!< Base address of module UC0 */
#define UC1_BASE_S                       (0x50584000U) /*!< Base address of module UC1 */
#define SPG0_BASE_S                      (0x5059F000U) /*!< Base address of module SPG0 */
#define UC5_UART_BASE_S                  (0x50608000U) /*!< Base address of module UC5_UART */
#define UC6_UART_BASE_S                  (0x5060A000U) /*!< Base address of module UC6_UART */
#define UC3_I2CC_BASE_S                  (0x50624000U) /*!< Base address of module UC3_I2CC */
#define UC4_I2CC_BASE_S                  (0x50626000U) /*!< Base address of module UC4_I2CC */
#define UC6_I2CC_BASE_S                  (0x5062A000U) /*!< Base address of module UC6_I2CC */
#define UC3_I2CT_BASE_S                  (0x50644000U) /*!< Base address of module UC3_I2CT */
#define UC4_I2CT_BASE_S                  (0x50646000U) /*!< Base address of module UC4_I2CT */
#define UC6_I2CT_BASE_S                  (0x5064A000U) /*!< Base address of module UC6_I2CT */
#define UC2_SPI_BASE_S                   (0x50660000U) /*!< Base address of module UC2_SPI */
#define UC6_SPI_BASE_S                   (0x5066A000U) /*!< Base address of module UC6_SPI */
#define UC2_BASE_S                       (0x50680000U) /*!< Base address of module UC2 */
#define UC3_BASE_S                       (0x50684000U) /*!< Base address of module UC3 */
#define UC4_BASE_S                       (0x50686000U) /*!< Base address of module UC4 */
#define UC5_BASE_S                       (0x50688000U) /*!< Base address of module UC5 */
#define UC6_BASE_S                       (0x5068A000U) /*!< Base address of module UC6 */
#define SPG1_BASE_S                      (0x5069F000U) /*!< Base address of module SPG1 */
#define UC7_UART_BASE_S                  (0x50700000U) /*!< Base address of module UC7_UART */
#define UC8_UART_BASE_S                  (0x50702000U) /*!< Base address of module UC8_UART */
#define UC9_UART_BASE_S                  (0x50704000U) /*!< Base address of module UC9_UART */
#define UC10_UART_BASE_S                 (0x50706000U) /*!< Base address of module UC10_UART */
#define UC7_I2CC_BASE_S                  (0x50720000U) /*!< Base address of module UC7_I2CC */
#define UC8_I2CC_BASE_S                  (0x50722000U) /*!< Base address of module UC8_I2CC */
#define UC9_I2CC_BASE_S                  (0x50724000U) /*!< Base address of module UC9_I2CC */
#define UC10_I2CC_BASE_S                 (0x50726000U) /*!< Base address of module UC10_I2CC */
#define UC7_I2CT_BASE_S                  (0x50740000U) /*!< Base address of module UC7_I2CT */
#define UC8_I2CT_BASE_S                  (0x50742000U) /*!< Base address of module UC8_I2CT */
#define UC9_I2CT_BASE_S                  (0x50744000U) /*!< Base address of module UC9_I2CT */
#define UC10_I2CT_BASE_S                 (0x50746000U) /*!< Base address of module UC10_I2CT */
#define UC7_SPI_BASE_S                   (0x50760000U) /*!< Base address of module UC7_SPI */
#define UC8_SPI_BASE_S                   (0x50762000U) /*!< Base address of module UC8_SPI */
#define UC9_SPI_BASE_S                   (0x50764000U) /*!< Base address of module UC9_SPI */
#define UC7_BASE_S                       (0x50780000U) /*!< Base address of module UC7 */
#define UC8_BASE_S                       (0x50782000U) /*!< Base address of module UC8 */
#define UC9_BASE_S                       (0x50784000U) /*!< Base address of module UC9 */
#define UC10_BASE_S                      (0x50786000U) /*!< Base address of module UC10 */
#define SPG2_BASE_S                      (0x5079F000U) /*!< Base address of module SPG2 */
#define GSC_BASE_S                       (0x50046000U) /*!< Base address of module GSC */
#define FACTORYREGION_BASE_S             (0x90111000U) /*!< Base address of module FACTORYREGION */
#define EAM_BASE_S                       (0x5002C000U) /*!< Base address of module EAM */
#define CANFD0_BASE_S                    (0x50110000U) /*!< Base address of module CANFD0 */
#define CANFD1_BASE_S                    (0x50118000U) /*!< Base address of module CANFD1 */
#define MEMCFG_BASE_S                    (0x5002A000U) /*!< Base address of module MEMCFG */
#define DMA0_BASE_S                      (0x50020000U) /*!< Base address of module DMA0 */
#define DMA1_BASE_S                      (0x50022000U) /*!< Base address of module DMA1 */
#define PKA_BASE_S                       (0x501C0000U) /*!< Base address of module PKA */
#define VREF_BASE_S                      (0x500E8000U) /*!< Base address of module VREF */
#define ADC0_ADC_LITE_REGS_BASE_S        (0x50000000U) /*!< Base address of module ADC0_ADC_LITE_REGS */
#define ADC0_ADC_LITE_RESULT_REGS_BASE_S (0x50004000U) /*!< Base address of module ADC0_ADC_LITE_RESULT_REGS */
#define ADC1_ADC_LITE_REGS_BASE_S        (0x50002000U) /*!< Base address of module ADC1_ADC_LITE_REGS */
#define ADC1_ADC_LITE_RESULT_REGS_BASE_S (0x50006000U) /*!< Base address of module ADC1_ADC_LITE_RESULT_REGS */
#define COMP1_BASE_S                     (0x500E2000U) /*!< Base address of module COMP1 */
#define FRI_BASE_S                       (0x50028000U) /*!< Base address of module FRI */
#define SHAW_BASE_S                      (0x501B4000U) /*!< Base address of module SHAW */
#define DFTSS_BASE_S                     (0x50034000U) /*!< Base address of module DFTSS */

