TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
static const UNICOMM_Inst_Regs UC0_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC0_BASE_S,
    .uart      = (UNICOMMUART_Regs *) UC0_UART_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC0_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC0_I2CT_BASE_S,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC1_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC1_BASE_S,
    .uart      = (UNICOMMUART_Regs *) UC1_UART_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC1_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC1_I2CT_BASE_S,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC2_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC2_BASE_S,
    .spi       = (UNICOMMSPI_Regs *) UC2_SPI_BASE_S,
    .fixedMode = true
};
static const UNICOMM_Inst_Regs UC3_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC3_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC3_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC3_I2CT_BASE_S,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC4_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC4_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC4_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC4_I2CT_BASE_S,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC5_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC5_BASE_S,
    .uart      = (UNICOMMUART_Regs *) UC5_UART_BASE_S,
    .fixedMode = true
};
static const UNICOMM_Inst_Regs UC6_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC6_BASE_S,
    .uart      = (UNICOMMUART_Regs *) UC6_UART_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC6_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC6_I2CT_BASE_S,
    .spi       = (UNICOMMSPI_Regs *) UC6_SPI_BASE_S,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC7_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC7_BASE_S,
    .uart      = (UNICOMMUART_Regs *) UC7_UART_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC7_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC7_I2CT_BASE_S,
    .spi       = (UNICOMMSPI_Regs *) UC7_SPI_BASE_S,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC8_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC8_BASE_S,
    .uart      = (UNICOMMUART_Regs *) UC8_UART_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC8_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC8_I2CT_BASE_S,
    .spi       = (UNICOMMSPI_Regs *) UC8_SPI_BASE_S,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC9_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC9_BASE_S,
    .uart      = (UNICOMMUART_Regs *) UC9_UART_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC9_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC9_I2CT_BASE_S,
    .spi       = (UNICOMMSPI_Regs *) UC9_SPI_BASE_S,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC10_Inst_S = {
    .inst      = (UNICOMM_Regs *) UC10_BASE_S,
    .uart      = (UNICOMMUART_Regs *) UC10_UART_BASE_S,
    .i2cc      = (UNICOMMI2CC_Regs *) UC10_I2CC_BASE_S,
    .i2ct      = (UNICOMMI2CT_Regs *) UC10_I2CT_BASE_S,
    .fixedMode = false
};
#define __MSP_HAS_ADC12__
#define __MSP_HAS_AESADVHP__
#define __MSP_HAS_COMP__
#define __MSP_HAS_CRCP__
#define __MSP_HAS_GPIO__
#define __MSP_HAS_TIMER_A__
#define __MSP_HAS_TIMER_G__
#define __MSP_HAS_I2C__
#define __MSP_HAS_KEYSTORE_CTL__
#define __MSP_HAS_MCAN__
#define __MSP_HAS_LFSS__
#define __MSP_HAS_SPI__
#define __MSP_HAS_TRNG__
#define __MSP_HAS_VREF__
#define __MSP_HAS_WWDT__
#define __MSP_HAS_IWDT__
#define __MSP_HAS_TIO__
#define __MSP_HAS_RTC__
#define __MSP_HAS_RTC_A__
#define __MSP_HAS_RTC_B__
#define __MSP_HAS_SCRATCHPAD__
#define __MSP_HAS_QSPI__
#define __MSP_HAS_I2S
#define __MSP_HAS_HSADC__

#define __MCU_HAS_SPGSS__
#define __MCU_HAS_UNICOMM__
#define __MCU_HAS_UNICOMMUART__
#define __MCU_HAS_UNICOMMI2CC__
#define __MCU_HAS_UNICOMMI2CT__
#define __MCU_HAS_UNICOMMSPI__
#define __MSP_HAS_EAM__
/*@}*/ /* end of group M33C1_MemoryMap */

/******************************************************************************
 * Peripheral declarations                                                     *
 ******************************************************************************/
/** @addtogroup M33C1_PeripheralDecl M33C1 Peripheral Declaration
  @{
*/

static TRNG_Regs                                      *const TRNG                                        = ((TRNG_Regs *)TRNG_BASE); 
static WWDT_Regs                                      *const WWDT0                                       = ((WWDT_Regs *)WWDT0_BASE); 
static CRCP_Regs                                      *const CRCP0                                       = ((CRCP_Regs *)CRCP0_BASE); 
static LFSS_Regs                                      *const LFSS                                        = ((LFSS_Regs *)LFSS_BASE); 
static GPIO_Regs                                      *const GPIOA                                       = ((GPIO_Regs *)GPIOA_BASE); 
static GPIO_Regs                                      *const GPIOB                                       = ((GPIO_Regs *)GPIOB_BASE); 
static GPIO_Regs                                      *const GPIOC                                       = ((GPIO_Regs *)GPIOC_BASE); 
static DEBUGSS_Regs                                   *const DEBUGSS                                     = ((DEBUGSS_Regs *)DEBUGSS_BASE); 
static AESADVHP_Regs                                  *const AESADV                                      = ((AESADVHP_Regs *)AESADV_BASE); 
static WUC_Regs                                       *const WUC                                         = ((WUC_Regs *)WUC_BASE); 
static KEYSTORECTL_Regs                               *const KEYSTORECTL                                 = ((KEYSTORECTL_Regs *)KEYSTORECTL_BASE); 
static I2S_Regs                                       *const I2S0                                        = ((I2S_Regs *)I2S0_BASE); 
static I2S_Regs                                       *const I2S1                                        = ((I2S_Regs *)I2S1_BASE); 
static GPTIMER_Regs                                   *const TIMA0_1                                     = ((GPTIMER_Regs *)TIMA0_1_BASE); 
static GPTIMER_Regs                                   *const TIMA0_0                                     = ((GPTIMER_Regs *)TIMA0_0_BASE); 
static GPTIMER_Regs                                   *const TIMG4_0                                     = ((GPTIMER_Regs *)TIMG4_0_BASE); 
static GPTIMER_Regs                                   *const TIMG4_1                                     = ((GPTIMER_Regs *)TIMG4_1_BASE); 
static GPTIMER_Regs                                   *const TIMG4_2                                     = ((GPTIMER_Regs *)TIMG4_2_BASE); 
static GPTIMER_Regs                                   *const TIMG4_3                                     = ((GPTIMER_Regs *)TIMG4_3_BASE); 
static GPTIMER_Regs                                   *const TIMG8_0                                     = ((GPTIMER_Regs *)TIMG8_0_BASE); 
static GPTIMER_Regs                                   *const TIMG8_1                                     = ((GPTIMER_Regs *)TIMG8_1_BASE); 
static GPTIMER_Regs                                   *const TIMG12_0                                    = ((GPTIMER_Regs *)TIMG12_0_BASE); 
static FLASHCTL_Regs                                  *const FLASHCTL                                    = ((FLASHCTL_Regs *)FLASHCTL_BASE); 
static IOMUX_Regs                                     *const IOMUX                                       = ((IOMUX_Regs *)IOMUX_BASE); 
static SHAW_Regs                                      *const SHAW                                        = ((SHAW_Regs *)SHAW_BASE); 
static QSPI_Regs                                      *const QSPI                                        = ((QSPI_Regs *)QSPI_BASE); 
static SYSCTL_Regs                                    *const SYSCTL                                      = ((SYSCTL_Regs *)SYSCTL_BASE); 
static COMP_Regs                                      *const COMP0                                       = ((COMP_Regs *) COMP0_BASE);
static GSC_Regs                                       *const GSC                                         = ((GSC_Regs *)GSC_BASE); 
static FACTORYREGION_OPEN_Regs                        *const FACTORYREGION                               = ((FACTORYREGION_OPEN_Regs *)FACTORYREGION_BASE); 
static FRI_Regs                                       *const FRI                                         = ((FRI_Regs *)FRI_BASE); 
static EAM_Regs                                       *const EAM                                         = ((EAM_Regs *) EAM_BASE);
static MCAN_Regs                                      *const CANFD0                                      = ((MCAN_Regs *)CANFD0_BASE); 
static MCAN_Regs                                      *const CANFD1                                      = ((MCAN_Regs *)CANFD1_BASE); 
static MEMCFG_Regs                                    *const MEMCFG                                      = ((MEMCFG_Regs *)MEMCFG_BASE); 
static DMA_Regs                                       *const DMA0                                        = ((DMA_Regs *)DMA0_BASE); 
static DMA_Regs                                       *const DMA1                                        = ((DMA_Regs *)DMA1_BASE); 
static PKA_Regs                                       *const PKA                                         = ((PKA_Regs *)PKA_BASE); 
static VREF_Regs                                      *const VREF                                        = ((VREF_Regs *)VREF_BASE); 
static hsadc_ADC_LITE_REGS_Regs                       *const ADC0_ADC_LITE_REGS                          = ((hsadc_ADC_LITE_REGS_Regs *)ADC0_ADC_LITE_REGS_BASE); 
static hsadc_ADC_LITE_RESULT_REGS_Regs                *const ADC0_ADC_LITE_RESULT_REGS                   = ((hsadc_ADC_LITE_RESULT_REGS_Regs *)ADC0_ADC_LITE_RESULT_REGS_BASE); 
static hsadc_ADC_LITE_REGS_Regs                       *const ADC1_ADC_LITE_REGS                          = ((hsadc_ADC_LITE_REGS_Regs *)ADC1_ADC_LITE_REGS_BASE); 
static hsadc_ADC_LITE_RESULT_REGS_Regs                *const ADC1_ADC_LITE_RESULT_REGS                   = ((hsadc_ADC_LITE_RESULT_REGS_Regs *)ADC1_ADC_LITE_RESULT_REGS_BASE); 
static COMP_Regs                                      *const COMP1                                       = ((COMP_Regs *)COMP1_BASE); 
static RTC_Regs                                       *const RTC                                         = ((RTC_Regs *)RTC_BASE); 
static RTC_Regs                                       *const RTC_A                                       = ((RTC_Regs *)RTC_A_BASE); 
static RTC_Regs                                       *const RTC_B                                       = ((RTC_Regs *)RTC_B_BASE); 
static UNICOMMUART_Regs                               * const UC0_UART                                   = ((UNICOMMUART_Regs *) UC0_UART_BASE);
static UNICOMMUART_Regs                               * const UC1_UART                                   = ((UNICOMMUART_Regs *) UC1_UART_BASE);
static UNICOMMI2CC_Regs                               * const UC0_I2CC                                   = ((UNICOMMI2CC_Regs *) UC0_I2CC_BASE);
static UNICOMMI2CC_Regs                               * const UC1_I2CC                                   = ((UNICOMMI2CC_Regs *) UC1_I2CC_BASE);
static UNICOMMI2CT_Regs                               * const UC0_I2CT                                   = ((UNICOMMI2CT_Regs *) UC0_I2CT_BASE);
static UNICOMMI2CT_Regs                               * const UC1_I2CT                                   = ((UNICOMMI2CT_Regs *) UC1_I2CT_BASE);
static UNICOMM_Inst_Regs                              * const UC0                                        = ((UNICOMM_Inst_Regs *) &UC0_Inst);
static UNICOMM_Inst_Regs                              * const UC1                                        = ((UNICOMM_Inst_Regs *) &UC1_Inst);
static SPGSS_Regs                                     * const SPG0                                       = ((SPGSS_Regs *) SPG0_BASE);
static UNICOMMUART_Regs                               * const UC5_UART                                   = ((UNICOMMUART_Regs *) UC5_UART_BASE);
static UNICOMMUART_Regs                               * const UC6_UART                                   = ((UNICOMMUART_Regs *) UC6_UART_BASE);
static UNICOMMI2CC_Regs                               * const UC3_I2CC                                   = ((UNICOMMI2CC_Regs *) UC3_I2CC_BASE);
static UNICOMMI2CC_Regs                               * const UC4_I2CC                                   = ((UNICOMMI2CC_Regs *) UC4_I2CC_BASE);
static UNICOMMI2CC_Regs                               * const UC6_I2CC                                   = ((UNICOMMI2CC_Regs *) UC6_I2CC_BASE);
static UNICOMMI2CT_Regs                               * const UC3_I2CT                                   = ((UNICOMMI2CT_Regs *) UC3_I2CT_BASE);
static UNICOMMI2CT_Regs                               * const UC4_I2CT                                   = ((UNICOMMI2CT_Regs *) UC4_I2CT_BASE);
static UNICOMMI2CT_Regs                               * const UC6_I2CT                                   = ((UNICOMMI2CT_Regs *) UC6_I2CT_BASE);
static UNICOMMSPI_Regs                                * const UC2_SPI                                    = ((UNICOMMSPI_Regs *) UC2_SPI_BASE);
static UNICOMMSPI_Regs                                * const UC6_SPI                                    = ((UNICOMMSPI_Regs *) UC6_SPI_BASE);
static UNICOMM_Inst_Regs                              * const UC2                                        = ((UNICOMM_Inst_Regs *) &UC2_Inst);
static UNICOMM_Inst_Regs                              * const UC3                                        = ((UNICOMM_Inst_Regs *) &UC3_Inst);
static UNICOMM_Inst_Regs                              * const UC4                                        = ((UNICOMM_Inst_Regs *) &UC4_Inst);
static UNICOMM_Inst_Regs                              * const UC5                                        = ((UNICOMM_Inst_Regs *) &UC5_Inst);
static UNICOMM_Inst_Regs                              * const UC6                                        = ((UNICOMM_Inst_Regs *) &UC6_Inst);
static SPGSS_Regs                                     * const SPG1                                       = ((SPGSS_Regs *) SPG1_BASE);
static UNICOMMUART_Regs                               * const UC7_UART                                   = ((UNICOMMUART_Regs *) UC7_UART_BASE);
static UNICOMMUART_Regs                               * const UC8_UART                                   = ((UNICOMMUART_Regs *) UC8_UART_BASE);
static UNICOMMUART_Regs                               * const UC9_UART                                   = ((UNICOMMUART_Regs *) UC9_UART_BASE);
static UNICOMMUART_Regs                               * const UC10_UART                                  = ((UNICOMMUART_Regs *) UC10_UART_BASE);
static UNICOMMI2CC_Regs                               * const UC7_I2CC                                   = ((UNICOMMI2CC_Regs *) UC7_I2CC_BASE);
static UNICOMMI2CC_Regs                               * const UC8_I2CC                                   = ((UNICOMMI2CC_Regs *) UC8_I2CC_BASE);
static UNICOMMI2CC_Regs                               * const UC9_I2CC                                   = ((UNICOMMI2CC_Regs *) UC9_I2CC_BASE);
static UNICOMMI2CC_Regs                               * const UC10_I2CC                                  = ((UNICOMMI2CC_Regs *) UC10_I2CC_BASE);
static UNICOMMI2CT_Regs                               * const UC7_I2CT                                   = ((UNICOMMI2CT_Regs *) UC7_I2CT_BASE);
static UNICOMMI2CT_Regs                               * const UC8_I2CT                                   = ((UNICOMMI2CT_Regs *) UC8_I2CT_BASE);
static UNICOMMI2CT_Regs                               * const UC9_I2CT                                   = ((UNICOMMI2CT_Regs *) UC9_I2CT_BASE);
static UNICOMMI2CT_Regs                               * const UC10_I2CT                                  = ((UNICOMMI2CT_Regs *) UC10_I2CT_BASE);
static UNICOMMSPI_Regs                                * const UC7_SPI                                    = ((UNICOMMSPI_Regs *) UC7_SPI_BASE);
static UNICOMMSPI_Regs                                * const UC8_SPI                                    = ((UNICOMMSPI_Regs *) UC8_SPI_BASE);
static UNICOMMSPI_Regs                                * const UC9_SPI                                    = ((UNICOMMSPI_Regs *) UC9_SPI_BASE);
static UNICOMM_Inst_Regs                              * const UC7                                        = ((UNICOMM_Inst_Regs *) &UC7_Inst);
static UNICOMM_Inst_Regs                              * const UC8                                        = ((UNICOMM_Inst_Regs *) &UC8_Inst);
static UNICOMM_Inst_Regs                              * const UC9                                        = ((UNICOMM_Inst_Regs *) &UC9_Inst);
static UNICOMM_Inst_Regs                              * const UC10                                       = ((UNICOMM_Inst_Regs *) &UC10_Inst);
static SPGSS_Regs                                     * const SPG2                                       = ((SPGSS_Regs *) SPG2_BASE);
static TRNG_Regs                                      *const TRNG_S                                      = ((TRNG_Regs *)TRNG_BASE_S); 
static WWDT_Regs                                      *const WWDT0_S                                     = ((WWDT_Regs *)WWDT0_BASE_S); 
static CRCP_Regs                                      *const CRCP0_S                                     = ((CRCP_Regs *)CRCP0_BASE_S); 
static LFSS_Regs                                      *const LFSS_S                                      = ((LFSS_Regs *)LFSS_BASE_S); 
static GPIO_Regs                                      *const GPIOA_S                                     = ((GPIO_Regs *)GPIOA_BASE_S); 
static GPIO_Regs                                      *const GPIOB_S                                     = ((GPIO_Regs *)GPIOB_BASE_S); 
static GPIO_Regs                                      *const GPIOC_S                                     = ((GPIO_Regs *)GPIOC_BASE_S); 
static DEBUGSS_Regs                                   *const DEBUGSS_S                                   = ((DEBUGSS_Regs *)DEBUGSS_BASE_S); 
static AESADVHP_Regs                                  *const AESADV_S                                    = ((AESADVHP_Regs *)AESADV_BASE_S); 
static WUC_Regs                                       *const WUC_S                                       = ((WUC_Regs *)WUC_BASE_S); 
static KEYSTORECTL_Regs                               *const KEYSTORECTL_S                               = ((KEYSTORECTL_Regs *)KEYSTORECTL_BASE_S); 
//static I2S_Regs                                     *const I2S0_S                                      = ((I2S_Regs *) I2S0_BASE_S);
//static I2S_Regs                                     *const I2S1_S                                      = ((I2S_Regs *) I2S1_BASE_S);
static GPTIMER_Regs                                   *const TIMA0_1_S                                   = ((GPTIMER_Regs *)TIMA0_1_BASE_S); 
static GPTIMER_Regs                                   *const TIMA0_0_S                                   = ((GPTIMER_Regs *)TIMA0_0_BASE_S); 
static GPTIMER_Regs                                   *const TIMG4_0_S                                   = ((GPTIMER_Regs *)TIMG4_0_BASE_S); 
static GPTIMER_Regs                                   *const TIMG4_1_S                                   = ((GPTIMER_Regs *)TIMG4_1_BASE_S); 
static GPTIMER_Regs                                   *const TIMG4_2_S                                   = ((GPTIMER_Regs *)TIMG4_2_BASE_S); 
static GPTIMER_Regs                                   *const TIMG4_3_S                                   = ((GPTIMER_Regs *)TIMG4_3_BASE_S); 
static GPTIMER_Regs                                   *const TIMG8_0_S                                   = ((GPTIMER_Regs *)TIMG8_0_BASE_S); 
static GPTIMER_Regs                                   *const TIMG8_1_S                                   = ((GPTIMER_Regs *)TIMG8_1_BASE_S); 
static GPTIMER_Regs                                   *const TIMG12_0_S                                  = ((GPTIMER_Regs *)TIMG12_0_BASE_S); 
static FLASHCTL_Regs                                  *const FLASHCTL_S                                  = ((FLASHCTL_Regs *)FLASHCTL_BASE_S); 
static IOMUX_Regs                                     *const IOMUX_S                                     = ((IOMUX_Regs *)IOMUX_BASE_S); 
static SHAW_Regs                                      *const SHAW_S                                      = ((SHAW_Regs *)SHAW_BASE_S); 
static QSPI_Regs                                      *const QSPI_S                                      = ((QSPI_Regs *)QSPI_BASE_S); 
static SYSCTL_Regs                                    *const SYSCTL_S                                    = ((SYSCTL_Regs *)SYSCTL_BASE_S); 
static COMP_Regs                                      *const COMP0_S                                     = ((COMP_Regs *) COMP0_BASE_S);
static GSC_Regs                                       *const GSC_S                                       = ((GSC_Regs *)GSC_BASE_S); 
static FACTORYREGION_OPEN_Regs                        *const FACTORYREGION_S                             = ((FACTORYREGION_OPEN_Regs *)FACTORYREGION_BASE_S); 
static FRI_Regs                                       *const FRI_S                                       = ((FRI_Regs *)FRI_BASE_S); 
static EAM_Regs                                       *const EAM_S                                       = ((EAM_Regs *) EAM_BASE_S);
static MCAN_Regs                                      *const CANFD0_S                                    = ((MCAN_Regs *)CANFD0_BASE_S); 
static MCAN_Regs                                      *const CANFD1_S                                    = ((MCAN_Regs *)CANFD1_BASE_S); 
static MEMCFG_Regs                                    *const MEMCFG_S                                    = ((MEMCFG_Regs *)MEMCFG_BASE_S); 
static DMA_Regs                                       *const DMA0_S                                      = ((DMA_Regs *)DMA0_BASE_S); 
static DMA_Regs                                       *const DMA1_S                                      = ((DMA_Regs *)DMA1_BASE_S); 
static PKA_Regs                                       *const PKA_S                                       = ((PKA_Regs *)PKA_BASE_S); 
static VREF_Regs                                      *const VREF_S                                      = ((VREF_Regs *)VREF_BASE_S); 
static hsadc_ADC_LITE_REGS_Regs                       *const ADC0_ADC_LITE_REGS_S                        = ((hsadc_ADC_LITE_REGS_Regs *)ADC0_ADC_LITE_REGS_BASE_S); 
static hsadc_ADC_LITE_RESULT_REGS_Regs                *const ADC0_ADC_LITE_RESULT_REGS_S                   = ((hsadc_ADC_LITE_RESULT_REGS_Regs *)ADC0_ADC_LITE_RESULT_REGS_BASE_S); 
static hsadc_ADC_LITE_REGS_Regs                       *const ADC1_ADC_LITE_REGS_S                        = ((hsadc_ADC_LITE_REGS_Regs *)ADC1_ADC_LITE_REGS_BASE_S); 
static hsadc_ADC_LITE_RESULT_REGS_Regs                *const ADC1_ADC_LITE_RESULT_REGS_S                   = ((hsadc_ADC_LITE_RESULT_REGS_Regs *)ADC1_ADC_LITE_RESULT_REGS_BASE_S); 
static COMP_Regs                                      *const COMP1_S                                     = ((COMP_Regs *)COMP1_BASE_S); 
static RTC_Regs                                       *const RTC_S                                       = ((RTC_Regs *)RTC_BASE_S); 
static RTC_Regs                                       *const RTC_A_S                                     = ((RTC_Regs *)RTC_A_BASE_S); 
static RTC_Regs                                       *const RTC_B_S                                     = ((RTC_Regs *)RTC_B_BASE_S); 
