TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
static UNICOMMUART_Regs                               * const UC0_UART_S                                   = ((UNICOMMUART_Regs *) UC0_UART_BASE_S);
static UNICOMMUART_Regs                               * const UC1_UART_S                                   = ((UNICOMMUART_Regs *) UC1_UART_BASE_S);
static UNICOMMI2CC_Regs                               * const UC0_I2CC_S                                   = ((UNICOMMI2CC_Regs *) UC0_I2CC_BASE_S);
static UNICOMMI2CC_Regs                               * const UC1_I2CC_S                                   = ((UNICOMMI2CC_Regs *) UC1_I2CC_BASE_S);
static UNICOMMI2CT_Regs                               * const UC0_I2CT_S                                   = ((UNICOMMI2CT_Regs *) UC0_I2CT_BASE_S);
static UNICOMMI2CT_Regs                               * const UC1_I2CT_S                                   = ((UNICOMMI2CT_Regs *) UC1_I2CT_BASE_S);
static UNICOMM_Inst_Regs                              * const UC0_S                                        = ((UNICOMM_Inst_Regs *) &UC0_Inst_S);
static UNICOMM_Inst_Regs                              * const UC1_S                                        = ((UNICOMM_Inst_Regs *) &UC1_Inst_S);
static SPGSS_Regs                                     * const SPG0_S                                       = ((SPGSS_Regs *) SPG0_BASE_S);
static UNICOMMUART_Regs                               * const UC5_UART_S                                   = ((UNICOMMUART_Regs *) UC5_UART_BASE_S);
static UNICOMMUART_Regs                               * const UC6_UART_S                                   = ((UNICOMMUART_Regs *) UC6_UART_BASE_S);
static UNICOMMI2CC_Regs                               * const UC3_I2CC_S                                   = ((UNICOMMI2CC_Regs *) UC3_I2CC_BASE_S);
static UNICOMMI2CC_Regs                               * const UC4_I2CC_S                                   = ((UNICOMMI2CC_Regs *) UC4_I2CC_BASE_S);
static UNICOMMI2CC_Regs                               * const UC6_I2CC_S                                   = ((UNICOMMI2CC_Regs *) UC6_I2CC_BASE_S);
static UNICOMMI2CT_Regs                               * const UC3_I2CT_S                                   = ((UNICOMMI2CT_Regs *) UC3_I2CT_BASE_S);
static UNICOMMI2CT_Regs                               * const UC4_I2CT_S                                   = ((UNICOMMI2CT_Regs *) UC4_I2CT_BASE_S);
static UNICOMMI2CT_Regs                               * const UC6_I2CT_S                                   = ((UNICOMMI2CT_Regs *) UC6_I2CT_BASE_S);
static UNICOMMSPI_Regs                                * const UC2_SPI_S                                    = ((UNICOMMSPI_Regs *) UC2_SPI_BASE_S);
static UNICOMMSPI_Regs                                * const UC6_SPI_S                                    = ((UNICOMMSPI_Regs *) UC6_SPI_BASE_S);
static UNICOMM_Inst_Regs                              * const UC2_S                                        = ((UNICOMM_Inst_Regs *) &UC2_Inst_S);
static UNICOMM_Inst_Regs                              * const UC3_S                                        = ((UNICOMM_Inst_Regs *) &UC3_Inst_S);
static UNICOMM_Inst_Regs                              * const UC4_S                                        = ((UNICOMM_Inst_Regs *) &UC4_Inst_S);
static UNICOMM_Inst_Regs                              * const UC5_S                                        = ((UNICOMM_Inst_Regs *) &UC5_Inst_S);
static UNICOMM_Inst_Regs                              * const UC6_S                                        = ((UNICOMM_Inst_Regs *) &UC6_Inst_S);
static SPGSS_Regs                                     * const SPG1_S                                       = ((SPGSS_Regs *) SPG1_BASE_S);
static UNICOMMUART_Regs                               * const UC7_UART_S                                   = ((UNICOMMUART_Regs *) UC7_UART_BASE_S);
static UNICOMMUART_Regs                               * const UC8_UART_S                                   = ((UNICOMMUART_Regs *) UC8_UART_BASE_S);
static UNICOMMUART_Regs                               * const UC9_UART_S                                   = ((UNICOMMUART_Regs *) UC9_UART_BASE_S);
static UNICOMMUART_Regs                               * const UC10_UART_S                                  = ((UNICOMMUART_Regs *) UC10_UART_BASE_S);
static UNICOMMI2CC_Regs                               * const UC7_I2CC_S                                   = ((UNICOMMI2CC_Regs *) UC7_I2CC_BASE_S);
static UNICOMMI2CC_Regs                               * const UC8_I2CC_S                                   = ((UNICOMMI2CC_Regs *) UC8_I2CC_BASE_S);
static UNICOMMI2CC_Regs                               * const UC9_I2CC_S                                   = ((UNICOMMI2CC_Regs *) UC9_I2CC_BASE_S);
static UNICOMMI2CC_Regs                               * const UC10_I2CC_S                                  = ((UNICOMMI2CC_Regs *) UC10_I2CC_BASE_S);
static UNICOMMI2CT_Regs                               * const UC7_I2CT_S                                   = ((UNICOMMI2CT_Regs *) UC7_I2CT_BASE_S);
static UNICOMMI2CT_Regs                               * const UC8_I2CT_S                                   = ((UNICOMMI2CT_Regs *) UC8_I2CT_BASE_S);
static UNICOMMI2CT_Regs                               * const UC9_I2CT_S                                   = ((UNICOMMI2CT_Regs *) UC9_I2CT_BASE_S);
static UNICOMMI2CT_Regs                               * const UC10_I2CT_S                                  = ((UNICOMMI2CT_Regs *) UC10_I2CT_BASE_S);
static UNICOMMSPI_Regs                                * const UC7_SPI_S                                    = ((UNICOMMSPI_Regs *) UC7_SPI_BASE_S);
static UNICOMMSPI_Regs                                * const UC8_SPI_S                                    = ((UNICOMMSPI_Regs *) UC8_SPI_BASE_S);
static UNICOMMSPI_Regs                                * const UC9_SPI_S                                    = ((UNICOMMSPI_Regs *) UC9_SPI_BASE_S);
static UNICOMM_Inst_Regs                              * const UC7_S                                        = ((UNICOMM_Inst_Regs *) &UC7_Inst_S);
static UNICOMM_Inst_Regs                              * const UC8_S                                        = ((UNICOMM_Inst_Regs *) &UC8_Inst_S);
static UNICOMM_Inst_Regs                              * const UC9_S                                        = ((UNICOMM_Inst_Regs *) &UC9_Inst_S);
static UNICOMM_Inst_Regs                              * const UC10_S                                       = ((UNICOMM_Inst_Regs *) &UC10_Inst_S);
static SPGSS_Regs                                     * const SPG2_S                                       = ((SPGSS_Regs *) SPG2_BASE_S);

