TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/******************************************************************************
 * SYS parameters                                                              *
 ******************************************************************************/
#define CRCP0_SYS_CRC32_ENABLE (1)        /* !< Parameter to exclude or include 32-bit CRC. This is added for      \
                                                Lego_N1 products where 32-bit CRC can be excluded in order to save \
                                                gates. */
#define I2S0_SYS_FENTRIES           (4)   /* !< Number of FIFO entries */
#define I2S1_SYS_FENTRIES           (4)   /* !< Number of FIFO entries */
#define FLASHCTL_SYS_DATAWIDTH      (128) /* !< Data bit width of a single flash word:    Minimum: 64    Maximum: 128 */
#define FLASHCTL_SYS_WEPROTBWIDTH   (28)  /* !< Bit width of WEPROTB register. */
#define FLASHCTL_SYS_WEPROTAWIDTH   (32)  /* !< Bit width of WEPROTA register. */
#define FLASHCTL_SYS_WEPROTCWIDTH   (0)   /* !< Bit width of WEPROTC register. */
#define QSPI_SYS_FENTRIES           (4)   /* !< The number of entries in RX and TX FIFO */
#define DMA0_SYS_N_DMA_CHANNEL      (4)   /* !< Number of DMA channels implemented in DMA. */
#define DMA0_SYS_N_DMA_FULL_CHANNEL (2)   /* !< Number of FULL-DMA channels implemented in DMA. If           \
                                                SYS_N_DMA_CHANNEL is larger than SYS_N_DMA_FULL_CHANNEL, the \
                                                remaining channel will be BASIC channel with limited functionality. */
#define DMA1_SYS_N_DMA_CHANNEL      (12)  /* !< Number of DMA channels implemented in DMA. */
#define DMA1_SYS_N_DMA_FULL_CHANNEL (6)   /* !< Number of FULL-DMA channels implemented in DMA. If           \
                                                SYS_N_DMA_CHANNEL is larger than SYS_N_DMA_FULL_CHANNEL, the \
                                                remaining channel will be BASIC channel with limited functionality.*/

#define DMA_SYS_N_DMA_CHANNEL      (4) /* !< Number of DMA channels implemented in DMA. */
#define DMA_SYS_N_DMA_FULL_CHANNEL (2) /* !< Number of FULL-DMA channels implemented in DMA. */
/******************************************************************************
 * DMA Triggers                                                                *
 ******************************************************************************/

/* External DMA0 Triggers */
#define DMA0_SOFTWARE_TRIG       (0)
#define DMA0_GENERIC_SUB0_TRIG   (1)
#define DMA0_GENERIC_SUB1_TRIG   (2)
#define DMA0_AESADVHP_AES_0_TRIG (3)
#define DMA0_AESADVHP_AES_1_TRIG (4)
#define DMA0_ADC0_TRIG1          (5)
#define DMA0_ADC0_TRIG2          (6)
#define DMA0_ADC0_TRIG3          (7)
#define DMA0_ADC0_TRIG4          (8)
#define DMA0_ADC1_TRIG1          (9)
#define DMA0_ADC1_TRIG2          (10)
#define DMA0_ADC1_TRIG3          (11)
#define DMA0_ADC1_TRIG4          (12)
#define DMA0_SHAW_TRIG           (13)
#define DMA0_I2S0_RX_TRIG        (14)
#define DMA0_I2S0_TX_TRIG        (15)
#define DMA0_I2S1_RX_TRIG        (16)
#define DMA0_I2S1_TX_TRIG        (17)
#define DMA0_QSPI_RX_TRIG        (18)
#define DMA0_QSPI_TX_TRIG        (19)
#define DMA0_UC0_TX_TRIG         (20)
#define DMA0_UC0_RX_TRIG         (21)
#define DMA0_UC1_TX_TRIG         (22)
#define DMA0_UC1_RX_TRIG         (23)
#define DMA0_UC2_TX_TRIG         (24)
#define DMA0_UC2_RX_TRIG         (25)
#define DMA0_UC3_TX_TRIG         (26)
#define DMA0_UC3_RX_TRIG         (27)
#define DMA0_UC4_TX_TRIG         (28)
#define DMA0_UC4_RX_TRIG         (29)
#define DMA0_UC5_TX_TRIG         (30)
#define DMA0_UC5_RX_TRIG         (31)
#define DMA0_UC6_TX_TRIG         (32)
#define DMA0_UC6_RX_TRIG         (33)
#define DMA0_UC7_TX_TRIG         (34)
#define DMA0_UC7_RX_TRIG         (35)
#define DMA0_UC8_TX_TRIG         (36)
#define DMA0_UC8_RX_TRIG         (37)
#define DMA0_UC9_TX_TRIG         (38)
#define DMA0_UC9_RX_TRIG         (39)
#define DMA0_UC10_TX_TRIG        (40)
#define DMA0_UC10_RX_TRIG        (41)

/* External DMA1 Triggers */
#define DMA1_SOFTWARE_TRIG       (0)
#define DMA1_GENERIC_SUB0_TRIG   (1)
#define DMA1_GENERIC_SUB1_TRIG   (2)
#define DMA1_AESADVHP_AES_0_TRIG (3)
#define DMA1_AESADVHP_AES_1_TRIG (4)
#define DMA1_ADC0_TRIG1          (5)
#define DMA1_ADC0_TRIG2          (6)
#define DMA1_ADC0_TRIG3          (7)
#define DMA1_ADC0_TRIG4          (8)
#define DMA1_ADC1_TRIG1          (9)
#define DMA1_ADC1_TRIG2          (10)
#define DMA1_ADC1_TRIG3          (11)
#define DMA1_ADC1_TRIG4          (12)
#define DMA1_SHAW_TRIG           (13)
#define DMA1_I2S0_RX_TRIG        (14)
#define DMA1_I2S0_TX_TRIG        (15)
#define DMA1_I2S1_RX_TRIG        (16)
#define DMA1_I2S1_TX_TRIG        (17)
#define DMA1_QSPI_RX_TRIG        (18)
#define DMA1_QSPI_TX_TRIG        (19)
#define DMA1_UC0_TX_TRIG         (20)
#define DMA1_UC0_RX_TRIG         (21)
#define DMA1_UC1_TX_TRIG         (22)
#define DMA1_UC1_RX_TRIG         (23)
#define DMA1_UC2_TX_TRIG         (24)
#define DMA1_UC2_RX_TRIG         (25)
#define DMA1_UC3_TX_TRIG         (26)
#define DMA1_UC3_RX_TRIG         (27)
#define DMA1_UC4_TX_TRIG         (28)
#define DMA1_UC4_RX_TRIG         (29)
#define DMA1_UC5_TX_TRIG         (30)
#define DMA1_UC5_RX_TRIG         (31)
#define DMA1_UC6_TX_TRIG         (32)
#define DMA1_UC6_RX_TRIG         (33)
#define DMA1_UC7_TX_TRIG         (34)
#define DMA1_UC7_RX_TRIG         (35)
#define DMA1_UC8_TX_TRIG         (36)
#define DMA1_UC8_RX_TRIG         (37)
#define DMA1_UC9_TX_TRIG         (38)
#define DMA1_UC9_RX_TRIG         (39)
#define DMA1_UC10_TX_TRIG        (40)
#define DMA1_UC10_RX_TRIG        (41)
/* Internal DMA0 Triggers */
#define DMA0_CH_0_TRIG (0)
#define DMA0_CH_1_TRIG (1)
#define DMA0_CH_2_TRIG (2)
#define DMA0_CH_3_TRIG (3)

/* Internal DMA1 Triggers */
#define DMA1_CH_0_TRIG  (0)
#define DMA1_CH_1_TRIG  (1)
#define DMA1_CH_2_TRIG  (2)
#define DMA1_CH_3_TRIG  (3)
#define DMA1_CH_4_TRIG  (4)
#define DMA1_CH_5_TRIG  (5)
#define DMA1_CH_6_TRIG  (6)
#define DMA1_CH_7_TRIG  (7)
#define DMA1_CH_8_TRIG  (8)
#define DMA1_CH_9_TRIG  (9)
#define DMA1_CH_10_TRIG (10)
#define DMA1_CH_11_TRIG (11)

