TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/******************************************************************************
 * IOMUX Pin Definitions                                                       *
 ******************************************************************************/

typedef enum IOMUX_PINCM {
    IOMUX_PINCM1  = (0),
    IOMUX_PINCM2  = (1),
    IOMUX_PINCM3  = (2),
    IOMUX_PINCM4  = (3),
    IOMUX_PINCM5  = (4),
    IOMUX_PINCM7  = (6),
    IOMUX_PINCM8  = (7),
    IOMUX_PINCM9  = (8),
    IOMUX_PINCM10 = (9),
    IOMUX_PINCM11 = (10),
    IOMUX_PINCM12 = (11),
    IOMUX_PINCM13 = (12),
    IOMUX_PINCM14 = (13),
    IOMUX_PINCM15 = (14),
    IOMUX_PINCM16 = (15),
    IOMUX_PINCM17 = (16),
    IOMUX_PINCM18 = (17),
    IOMUX_PINCM19 = (18),
    IOMUX_PINCM20 = (19),
    IOMUX_PINCM21 = (20),
    IOMUX_PINCM22 = (21),
    IOMUX_PINCM23 = (22),
    IOMUX_PINCM24 = (23),
    IOMUX_PINCM25 = (24),
    IOMUX_PINCM26 = (25),
    IOMUX_PINCM27 = (26),
    IOMUX_PINCM28 = (27),
    IOMUX_PINCM29 = (28),
    IOMUX_PINCM30 = (29),
    IOMUX_PINCM31 = (30),
    IOMUX_PINCM32 = (31),
    IOMUX_PINCM33 = (32),
    IOMUX_PINCM34 = (33),
    IOMUX_PINCM35 = (34),
    IOMUX_PINCM36 = (35),
    IOMUX_PINCM37 = (36),
    IOMUX_PINCM38 = (37),
    IOMUX_PINCM39 = (38),
    IOMUX_PINCM40 = (39),
    IOMUX_PINCM41 = (40),
    IOMUX_PINCM42 = (41),
    IOMUX_PINCM43 = (42),
    IOMUX_PINCM44 = (43),
    IOMUX_PINCM45 = (44),
    IOMUX_PINCM46 = (45),
    IOMUX_PINCM47 = (46),
    IOMUX_PINCM48 = (47),
    IOMUX_PINCM49 = (48),
    IOMUX_PINCM50 = (49),
    IOMUX_PINCM51 = (50),
    IOMUX_PINCM52 = (51),
    IOMUX_PINCM53 = (52),
    IOMUX_PINCM54 = (53),
    IOMUX_PINCM55 = (54),
    IOMUX_PINCM56 = (55),
    IOMUX_PINCM57 = (56),
    IOMUX_PINCM58 = (57),
    IOMUX_PINCM59 = (58),
    IOMUX_PINCM60 = (59),
    IOMUX_PINCM61 = (60),
    IOMUX_PINCM62 = (61),
    IOMUX_PINCM63 = (62),
    IOMUX_PINCM64 = (63),
    IOMUX_PINCM65 = (64),
    IOMUX_PINCM66 = (65),
    IOMUX_PINCM67 = (66),
    IOMUX_PINCM68 = (67),
    IOMUX_PINCM69 = (68),
    IOMUX_PINCM70 = (69),
    IOMUX_PINCM71 = (70),
    IOMUX_PINCM72 = (71),
    IOMUX_PINCM73 = (72),
    IOMUX_PINCM74 = (73),
    IOMUX_PINCM75 = (74),
    IOMUX_PINCM76 = (75),
    IOMUX_PINCM77 = (76),
    IOMUX_PINCM78 = (77),
    IOMUX_PINCM79 = (78),
    IOMUX_PINCM80 = (79),
    IOMUX_PINCM81 = (80),
    IOMUX_PINCM82 = (81),
    IOMUX_PINCM83 = (82),
    IOMUX_PINCM84 = (83),
    IOMUX_PINCM85 = (84),
    IOMUX_PINCM86 = (85),
    IOMUX_PINCM87 = (86),
    IOMUX_PINCM88 = (87),
    IOMUX_PINCM89 = (88),
    IOMUX_PINCM90 = (89),
    IOMUX_PINCM91 = (90),
    IOMUX_PINCM92 = (91),
    IOMUX_PINCM93 = (92),
    IOMUX_PINCM94 = (93),
} IOMUX_PINCM;

/* IOMUX_PINCM1[PF] Bits */
#define IOMUX_PINCM1_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM1_PF_GPIOA_DIO00                   ((uint32_t)0X00000001)
#define IOMUX_PINCM1_PF_TIMA_0_FAULT1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM1_PF_UC0_SDA                       ((uint32_t)0X00000003)
#define IOMUX_PINCM1_PF_UC0_TX                        ((uint32_t)0X00000003)
#define IOMUX_PINCM1_PF_UC9_SCLK                      ((uint32_t)0X00000004)
#define IOMUX_PINCM1_PF_UC9_SCL                       ((uint32_t)0X00000004)
#define IOMUX_PINCM1_PF_UC9_RX                        ((uint32_t)0X00000004)
#define IOMUX_PINCM1_PF_UC5_TX                        ((uint32_t)0X00000005)
#define IOMUX_PINCM1_PF_UC3_SDA                       ((uint32_t)0X00000006)

/* IOMUX_PINCM2[PF] Bits */
#define IOMUX_PINCM2_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM2_PF_GPIOA_DIO01                   ((uint32_t)0X00000001)
#define IOMUX_PINCM2_PF_TIMA_1_FAULT0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM2_PF_UC0_SCL                       ((uint32_t)0X00000003)
#define IOMUX_PINCM2_PF_UC0_RX                        ((uint32_t)0X00000003)
#define IOMUX_PINCM2_PF_UC9_PICO                      ((uint32_t)0X00000004)
#define IOMUX_PINCM2_PF_UC9_SDA                       ((uint32_t)0X00000004)
#define IOMUX_PINCM2_PF_UC9_TX                        ((uint32_t)0X00000004)
#define IOMUX_PINCM2_PF_UC5_RX                        ((uint32_t)0X00000005)
#define IOMUX_PINCM2_PF_UC3_SCL                       ((uint32_t)0X00000006)
#define IOMUX_PINCM2_PF_TIMG8_0_IDX                   ((uint32_t)0X00000007)
#define IOMUX_PINCM2_PF_TIMA0_0_CCP1                  ((uint32_t)0X00000008)

/* IOMUX_PINCM3[PF] Bits */
#define IOMUX_PINCM3_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM3_PF_GPIOA_DIO28                   ((uint32_t)0X00000001)
#define IOMUX_PINCM3_PF_TIMA_0_FAULT0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM3_PF_UC0_SDA                       ((uint32_t)0X00000003)
#define IOMUX_PINCM3_PF_UC0_TX                        ((uint32_t)0X00000003)
#define IOMUX_PINCM3_PF_UC9_CS0                       ((uint32_t)0X00000004)
#define IOMUX_PINCM3_PF_UC9_CTS                       ((uint32_t)0X00000004)
#define IOMUX_PINCM3_PF_UC5_TX                        ((uint32_t)0X00000005)
#define IOMUX_PINCM3_PF_UC3_SDA                       ((uint32_t)0X00000006)

/* IOMUX_PINCM4[PF] Bits */
#define IOMUX_PINCM4_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM4_PF_GPIOA_DIO29                   ((uint32_t)0X00000001)
#define IOMUX_PINCM4_PF_TIMG4_2_CCP0                  ((uint32_t)0X00000002)
#define IOMUX_PINCM4_PF_TIMA_1_FAULT1                 ((uint32_t)0X00000003)
#define IOMUX_PINCM4_PF_UC9_POCI                      ((uint32_t)0X00000004)
#define IOMUX_PINCM4_PF_UC9_RTS                       ((uint32_t)0X00000004)
#define IOMUX_PINCM4_PF_UC5_RTS                       ((uint32_t)0X00000005)
#define IOMUX_PINCM4_PF_UC1_SCL                       ((uint32_t)0X00000006)
#define IOMUX_PINCM4_PF_UC1_RX                        ((uint32_t)0X00000006)
#define IOMUX_PINCM4_PF_UC4_SCL                       ((uint32_t)0X00000007)

/* IOMUX_PINCM5[PF] Bits */
#define IOMUX_PINCM5_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM5_PF_GPIOA_DIO30                   ((uint32_t)0X00000001)
#define IOMUX_PINCM5_PF_TIMG4_2_CCP1                  ((uint32_t)0X00000002)
#define IOMUX_PINCM5_PF_TIMA_0_FAULT2                 ((uint32_t)0X00000003)
#define IOMUX_PINCM5_PF_UC5_CTS                       ((uint32_t)0X00000005)
#define IOMUX_PINCM5_PF_UC1_SDA                       ((uint32_t)0X00000006)
#define IOMUX_PINCM5_PF_UC1_TX                        ((uint32_t)0X00000006)
#define IOMUX_PINCM5_PF_UC4_SDA                       ((uint32_t)0X00000007)

