TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/* IOMUX_PINCM7[PF] Bits */
#define IOMUX_PINCM7_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM7_PF_GPIOA_DIO02                   ((uint32_t)0X00000001)
#define IOMUX_PINCM7_PF_TIMG8_0_CCP1                  ((uint32_t)0X00000002)
#define IOMUX_PINCM7_PF_TIMA0_0_CCP1                  ((uint32_t)0X00000003)
#define IOMUX_PINCM7_PF_UC5_RX                        ((uint32_t)0X00000004)
#define IOMUX_PINCM7_PF_UC2_CS0                       ((uint32_t)0X00000005)
#define IOMUX_PINCM7_PF_UC7_POCI                      ((uint32_t)0X00000006)
#define IOMUX_PINCM7_PF_UC7_RTS                       ((uint32_t)0X00000006)
#define IOMUX_PINCM7_PF_UC9_POCI                      ((uint32_t)0X00000007)
#define IOMUX_PINCM7_PF_UC9_RTS                       ((uint32_t)0X00000007)

/* IOMUX_PINCM8[PF] Bits */
#define IOMUX_PINCM8_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM8_PF_GPIOA_DIO03                   ((uint32_t)0X00000001)
#define IOMUX_PINCM8_PF_TIMG8_0_CCP0                  ((uint32_t)0X00000002)
#define IOMUX_PINCM8_PF_TIMA0_0_CCP1                  ((uint32_t)0X00000003)
#define IOMUX_PINCM8_PF_UC1_SDA                       ((uint32_t)0X00000004)
#define IOMUX_PINCM8_PF_UC1_TX                        ((uint32_t)0X00000004)
#define IOMUX_PINCM8_PF_UC2_CS1                       ((uint32_t)0X00000005)
#define IOMUX_PINCM8_PF_COMP1_OUT                     ((uint32_t)0X00000006)
#define IOMUX_PINCM8_PF_UC4_SDA                       ((uint32_t)0X00000007)

/* IOMUX_PINCM9[PF] Bits */
#define IOMUX_PINCM9_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM9_PF_GPIOA_DIO04                   ((uint32_t)0X00000001)
#define IOMUX_PINCM9_PF_SYSCTL_LFCLKIN                ((uint32_t)0X00000002)
#define IOMUX_PINCM9_PF_TIMA0_0_CCP1_CMPL             ((uint32_t)0X00000003)
#define IOMUX_PINCM9_PF_UC1_SCL                       ((uint32_t)0X00000004)
#define IOMUX_PINCM9_PF_UC1_RX                        ((uint32_t)0X00000004)
#define IOMUX_PINCM9_PF_UC2_POCI                      ((uint32_t)0X00000005)
#define IOMUX_PINCM9_PF_UC7_CS0                       ((uint32_t)0X00000006)
#define IOMUX_PINCM9_PF_UC7_CTS                       ((uint32_t)0X00000006)
#define IOMUX_PINCM9_PF_UC4_SCL                       ((uint32_t)0X00000007)

/* IOMUX_PINCM10[PF] Bits */
#define IOMUX_PINCM10_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM10_PF_GPIOA_DIO05                  ((uint32_t)0X00000001)
#define IOMUX_PINCM10_PF_TIMG4_2_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM10_PF_TIMG4_0_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM10_PF_UC2_PICO                     ((uint32_t)0X00000005)

/* IOMUX_PINCM11[PF] Bits */
#define IOMUX_PINCM11_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM11_PF_GPIOA_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM11_PF_TIMG4_2_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM11_PF_SYSCTL_HFCLKIN               ((uint32_t)0X00000003)
#define IOMUX_PINCM11_PF_TIMA0_0_CCP2_CMPL            ((uint32_t)0X00000004)
#define IOMUX_PINCM11_PF_UC2_SCLK                     ((uint32_t)0X00000005)
#define IOMUX_PINCM11_PF_TIMG4_0_CCP1                 ((uint32_t)0X00000006)

/* IOMUX_PINCM12[PF] Bits */
#define IOMUX_PINCM12_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM12_PF_GPIOB_DIO00                  ((uint32_t)0X00000001)
#define IOMUX_PINCM12_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM12_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM12_PF_TIMG4_1_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM12_PF_UC5_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM12_PF_TIMA0_1_CCP2                 ((uint32_t)0X00000005)

/* IOMUX_PINCM13[PF] Bits */
#define IOMUX_PINCM13_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM13_PF_GPIOB_DIO01                  ((uint32_t)0X00000001)
#define IOMUX_PINCM13_PF_UC0_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM13_PF_UC0_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM13_PF_TIMG4_1_CCP1                 ((uint32_t)0X00000003)
#define IOMUX_PINCM13_PF_UC5_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM13_PF_TIMA0_1_CCP2_CMPL            ((uint32_t)0X00000005)

/* IOMUX_PINCM14[PF] Bits */
#define IOMUX_PINCM14_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM14_PF_GPIOA_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM14_PF_TIMG4_3_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM14_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000003)
#define IOMUX_PINCM14_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM14_PF_TIMA0_0_CCP2                 ((uint32_t)0X00000005)
#define IOMUX_PINCM14_PF_I2S0_WCLK                    ((uint32_t)0X00000006)

/* IOMUX_PINCM15[PF] Bits */
#define IOMUX_PINCM15_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM15_PF_GPIOB_DIO02                  ((uint32_t)0X00000001)
#define IOMUX_PINCM15_PF_TIMG4_2_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM15_PF_TIMA0_0_CCP3                 ((uint32_t)0X00000003)
#define IOMUX_PINCM15_PF_UC7_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM15_PF_UC7_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM15_PF_UC1_SCL                      ((uint32_t)0X00000005)
#define IOMUX_PINCM15_PF_UC1_RX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM15_PF_UC4_SCL                      ((uint32_t)0X00000006)

/* IOMUX_PINCM16[PF] Bits */
#define IOMUX_PINCM16_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM16_PF_GPIOB_DIO03                  ((uint32_t)0X00000001)
#define IOMUX_PINCM16_PF_TIMG4_2_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM16_PF_TIMA0_0_CCP3_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM16_PF_UC7_POCI                     ((uint32_t)0X00000004)
#define IOMUX_PINCM16_PF_UC7_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM16_PF_UC1_SDA                      ((uint32_t)0X00000005)
#define IOMUX_PINCM16_PF_UC1_TX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM16_PF_UC4_SDA                      ((uint32_t)0X00000006)

/* IOMUX_PINCM17[PF] Bits */
#define IOMUX_PINCM17_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM17_PF_GPIOB_DIO04                  ((uint32_t)0X00000001)
#define IOMUX_PINCM17_PF_TIMA0_0_CCP2                 ((uint32_t)0X00000002)
#define IOMUX_PINCM17_PF_UC1_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM17_PF_UC1_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM17_PF_UC6_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM17_PF_UC6_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM17_PF_UC7_PICO                     ((uint32_t)0X00000005)
#define IOMUX_PINCM17_PF_UC7_SDA                      ((uint32_t)0X00000005)
#define IOMUX_PINCM17_PF_UC7_TX                       ((uint32_t)0X00000005)

/* IOMUX_PINCM18[PF] Bits */
#define IOMUX_PINCM18_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM18_PF_GPIOB_DIO05                  ((uint32_t)0X00000001)
#define IOMUX_PINCM18_PF_TIMA0_0_CCP2_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM18_PF_UC1_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM18_PF_UC1_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM18_PF_UC6_POCI                     ((uint32_t)0X00000004)
#define IOMUX_PINCM18_PF_UC6_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM18_PF_UC7_POCI                     ((uint32_t)0X00000005)
#define IOMUX_PINCM18_PF_UC7_RTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM18_PF_UC2_POCI                     ((uint32_t)0X00000006)

/* IOMUX_PINCM19[PF] Bits */
#define IOMUX_PINCM19_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM19_PF_GPIOA_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM19_PF_TIMA0_0_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM19_PF_TIMA0_1_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM19_PF_UC0_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM19_PF_UC1_SDA                      ((uint32_t)0X00000005)
#define IOMUX_PINCM19_PF_UC1_TX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM19_PF_UC2_SCLK                     ((uint32_t)0X00000006)
#define IOMUX_PINCM19_PF_UC5_RTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM19_PF_I2S0_WCLK                    ((uint32_t)0X00000008)

/* IOMUX_PINCM20[PF] Bits */
#define IOMUX_PINCM20_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM20_PF_GPIOA_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM20_PF_TIMA0_0_CCP0_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM20_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000003)
#define IOMUX_PINCM20_PF_UC0_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM20_PF_UC1_SCL                      ((uint32_t)0X00000005)
#define IOMUX_PINCM20_PF_UC1_RX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM20_PF_UC2_PICO                     ((uint32_t)0X00000006)
#define IOMUX_PINCM20_PF_UC5_CTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM20_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000008)
#define IOMUX_PINCM20_PF_I2S0_MCLK                    ((uint32_t)0X00000009)
#define IOMUX_PINCM20_PF_DFTSS_TDO                    ((uint32_t)0X0000000A)

