TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/* IOMUX_PINCM21[PF] Bits */
#define IOMUX_PINCM21_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM21_PF_GPIOA_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM21_PF_TIMG12_0_CCP0                ((uint32_t)0X00000002)
#define IOMUX_PINCM21_PF_TIMA0_0_CCP2                 ((uint32_t)0X00000003)
#define IOMUX_PINCM21_PF_UC0_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM21_PF_UC0_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM21_PF_UC2_POCI                     ((uint32_t)0X00000005)
#define IOMUX_PINCM21_PF_UC3_SDA                      ((uint32_t)0X00000006)
#define IOMUX_PINCM21_PF_UC5_TX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM21_PF_UC7_SCLK                     ((uint32_t)0X00000008)
#define IOMUX_PINCM21_PF_UC7_SCL                      ((uint32_t)0X00000008)
#define IOMUX_PINCM21_PF_UC7_RX                       ((uint32_t)0X00000008)

/* IOMUX_PINCM22[PF] Bits */
#define IOMUX_PINCM22_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM22_PF_GPIOA_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM22_PF_TIMA0_1_CCP0_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM22_PF_TIMA0_0_CCP2_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM22_PF_UC0_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM22_PF_UC0_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM22_PF_UC2_SCLK                     ((uint32_t)0X00000005)
#define IOMUX_PINCM22_PF_UC3_SCL                      ((uint32_t)0X00000006)
#define IOMUX_PINCM22_PF_UC5_RX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM22_PF_COMP0_OUT                    ((uint32_t)0X00000008)

/* IOMUX_PINCM23[PF] Bits */
#define IOMUX_PINCM23_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM23_PF_GPIOB_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM23_PF_TIMG4_2_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_TIMA0_1_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM23_PF_I2S1_AD0                     ((uint32_t)0X00000004)
#define IOMUX_PINCM23_PF_UC1_SDA                      ((uint32_t)0X00000005)
#define IOMUX_PINCM23_PF_UC1_TX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM23_PF_UC5_CTS                      ((uint32_t)0X00000006)
#define IOMUX_PINCM23_PF_UC2_CS1                      ((uint32_t)0X00000007)
#define IOMUX_PINCM23_PF_CANFD1_CANRX                 ((uint32_t)0X00000009)

/* IOMUX_PINCM24[PF] Bits */
#define IOMUX_PINCM24_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM24_PF_GPIOB_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM24_PF_TIMG4_2_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_TIMG8_1_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM24_PF_TIMA0_1_CCP0_CMPL            ((uint32_t)0X00000004)
#define IOMUX_PINCM24_PF_I2S1_AD1                     ((uint32_t)0X00000005)
#define IOMUX_PINCM24_PF_UC1_SCL                      ((uint32_t)0X00000006)
#define IOMUX_PINCM24_PF_UC1_RX                       ((uint32_t)0X00000006)
#define IOMUX_PINCM24_PF_UC5_RTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM24_PF_UC6_POCI                     ((uint32_t)0X00000008)
#define IOMUX_PINCM24_PF_UC6_RTS                      ((uint32_t)0X00000008)
#define IOMUX_PINCM24_PF_CANFD1_CANTX                 ((uint32_t)0X00000009)

/* IOMUX_PINCM25[PF] Bits */
#define IOMUX_PINCM25_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM25_PF_GPIOB_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM25_PF_TIMG8_1_IDX                  ((uint32_t)0X00000002)
#define IOMUX_PINCM25_PF_COMP1_OUT                    ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_TIMA_1_FAULT1                ((uint32_t)0X00000004)
#define IOMUX_PINCM25_PF_I2S1_WCLK                    ((uint32_t)0X00000005)
#define IOMUX_PINCM25_PF_UC1_CTS                      ((uint32_t)0X00000006)
#define IOMUX_PINCM25_PF_UC6_SCLK                     ((uint32_t)0X00000007)
#define IOMUX_PINCM25_PF_UC6_SCL                      ((uint32_t)0X00000007)
#define IOMUX_PINCM25_PF_UC6_RX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM25_PF_UC6_PICO                     ((uint32_t)0X00000008)
#define IOMUX_PINCM25_PF_UC6_SDA                      ((uint32_t)0X00000008)
#define IOMUX_PINCM25_PF_UC6_TX                       ((uint32_t)0X00000008)

/* IOMUX_PINCM26[PF] Bits */
#define IOMUX_PINCM26_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM26_PF_GPIOB_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM26_PF_TIMG8_1_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM26_PF_TIMA0_0_CCP0_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_I2S1_BCLK                    ((uint32_t)0X00000004)
#define IOMUX_PINCM26_PF_UC1_RTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM26_PF_UC6_PICO                     ((uint32_t)0X00000006)
#define IOMUX_PINCM26_PF_UC6_SDA                      ((uint32_t)0X00000006)
#define IOMUX_PINCM26_PF_UC6_TX                       ((uint32_t)0X00000006)
#define IOMUX_PINCM26_PF_UC6_SCLK                     ((uint32_t)0X00000007)
#define IOMUX_PINCM26_PF_UC6_SCL                      ((uint32_t)0X00000007)
#define IOMUX_PINCM26_PF_UC6_RX                       ((uint32_t)0X00000007)

/* IOMUX_PINCM27[PF] Bits */
#define IOMUX_PINCM27_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM27_PF_GPIOB_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM27_PF_TIMG4_2_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM27_PF_TIMG4_0_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM27_PF_I2S1_MCLK                    ((uint32_t)0X00000004)
#define IOMUX_PINCM27_PF_UC8_PICO                     ((uint32_t)0X00000005)
#define IOMUX_PINCM27_PF_UC8_SDA                      ((uint32_t)0X00000005)
#define IOMUX_PINCM27_PF_UC8_TX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM27_PF_TIMA0_1_CCP1                 ((uint32_t)0X00000006)
#define IOMUX_PINCM27_PF_I2S0_WCLK                    ((uint32_t)0X00000008)

