TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/* IOMUX_PINCM28[PF] Bits */
#define IOMUX_PINCM28_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM28_PF_GPIOB_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM28_PF_TIMG4_2_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM28_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000003)
#define IOMUX_PINCM28_PF_TIMG4_0_CCP1                 ((uint32_t)0X00000004)
#define IOMUX_PINCM28_PF_UC8_SCLK                     ((uint32_t)0X00000005)
#define IOMUX_PINCM28_PF_UC8_SCL                      ((uint32_t)0X00000005)
#define IOMUX_PINCM28_PF_UC8_RX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM28_PF_TIMA0_1_CCP1_CMPL            ((uint32_t)0X00000006)
#define IOMUX_PINCM28_PF_I2S0_BCLK                    ((uint32_t)0X00000008)

/* IOMUX_PINCM29[PF] Bits */
#define IOMUX_PINCM29_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM29_PF_GPIOB_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM29_PF_TIMA_0_FAULT1                ((uint32_t)0X00000002)
#define IOMUX_PINCM29_PF_UC6_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM29_PF_UC6_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM29_PF_UC6_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM29_PF_UC8_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM29_PF_UC8_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM29_PF_I2S0_AD0                     ((uint32_t)0X00000008)

/* IOMUX_PINCM30[PF] Bits */
#define IOMUX_PINCM30_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM30_PF_GPIOB_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM30_PF_TIMG12_0_CCP0                ((uint32_t)0X00000002)
#define IOMUX_PINCM30_PF_TIMA0_0_CCP1_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM30_PF_UC6_SCLK                     ((uint32_t)0X00000004)
#define IOMUX_PINCM30_PF_UC6_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM30_PF_UC6_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM30_PF_UC8_POCI                     ((uint32_t)0X00000005)
#define IOMUX_PINCM30_PF_UC8_RTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM30_PF_QSPI_CS2_POCI2               ((uint32_t)0X00000006)
#define IOMUX_PINCM30_PF_I2S0_AD1                     ((uint32_t)0X00000008)

/* IOMUX_PINCM31[PF] Bits */
#define IOMUX_PINCM31_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM31_PF_GPIOB_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM31_PF_TIMG8_0_IDX                  ((uint32_t)0X00000002)
#define IOMUX_PINCM31_PF_TIMG12_0_CCP1                ((uint32_t)0X00000003)
#define IOMUX_PINCM31_PF_TIMA0_0_CCP0                 ((uint32_t)0X00000004)
#define IOMUX_PINCM31_PF_QSPI_CS0                     ((uint32_t)0X00000006)
#define IOMUX_PINCM31_PF_UC6_POCI                     ((uint32_t)0X00000007)
#define IOMUX_PINCM31_PF_UC6_RTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM31_PF_I2S0_MCLK                    ((uint32_t)0X00000008)

/* IOMUX_PINCM32[PF] Bits */
#define IOMUX_PINCM32_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM32_PF_GPIOB_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM32_PF_TIMG4_3_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM32_PF_TIMG8_0_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_TIMA0_1_CCP3                 ((uint32_t)0X00000004)
#define IOMUX_PINCM32_PF_I2S0_MCLK                    ((uint32_t)0X00000005)
#define IOMUX_PINCM32_PF_QSPI_IO3                     ((uint32_t)0X00000006)
#define IOMUX_PINCM32_PF_UC7_PICO                     ((uint32_t)0X00000007)
#define IOMUX_PINCM32_PF_UC7_SDA                      ((uint32_t)0X00000007)
#define IOMUX_PINCM32_PF_UC7_TX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM32_PF_UC5_TX                       ((uint32_t)0X00000008)

/* IOMUX_PINCM33[PF] Bits */
#define IOMUX_PINCM33_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM33_PF_GPIOB_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM33_PF_TIMG4_3_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM33_PF_TIMG8_0_CCP1                 ((uint32_t)0X00000003)
#define IOMUX_PINCM33_PF_TIMA0_1_CCP3_CMPL            ((uint32_t)0X00000004)
#define IOMUX_PINCM33_PF_I2S0_WCLK                    ((uint32_t)0X00000005)
#define IOMUX_PINCM33_PF_QSPI_SCLK                    ((uint32_t)0X00000006)
#define IOMUX_PINCM33_PF_UC7_SCLK                     ((uint32_t)0X00000007)
#define IOMUX_PINCM33_PF_UC7_SCL                      ((uint32_t)0X00000007)
#define IOMUX_PINCM33_PF_UC7_RX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM33_PF_UC5_RX                       ((uint32_t)0X00000008)

/* IOMUX_PINCM34[PF] Bits */
#define IOMUX_PINCM34_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM34_PF_GPIOA_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM34_PF_CANFD0_CANTX                 ((uint32_t)0X00000002)
#define IOMUX_PINCM34_PF_TIMG4_0_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM34_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000004)
#define IOMUX_PINCM34_PF_I2S0_BCLK                    ((uint32_t)0X00000005)
#define IOMUX_PINCM34_PF_QSPI_PICO                    ((uint32_t)0X00000006)
#define IOMUX_PINCM34_PF_UC6_CS0                      ((uint32_t)0X00000007)
#define IOMUX_PINCM34_PF_UC6_CTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM34_PF_TIMA0_1_CCP1                 ((uint32_t)0X00000008)

/* IOMUX_PINCM35[PF] Bits */
#define IOMUX_PINCM35_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM35_PF_GPIOA_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM35_PF_CANFD0_CANRX                 ((uint32_t)0X00000002)
#define IOMUX_PINCM35_PF_TIMG4_0_CCP1                 ((uint32_t)0X00000003)
#define IOMUX_PINCM35_PF_TIMA_1_FAULT1                ((uint32_t)0X00000004)
#define IOMUX_PINCM35_PF_I2S0_AD0                     ((uint32_t)0X00000005)
#define IOMUX_PINCM35_PF_QSPI_IO2                     ((uint32_t)0X00000006)
#define IOMUX_PINCM35_PF_UC6_SCLK                     ((uint32_t)0X00000007)
#define IOMUX_PINCM35_PF_UC6_SCL                      ((uint32_t)0X00000007)
#define IOMUX_PINCM35_PF_UC6_RX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM35_PF_UC6_POCI                     ((uint32_t)0X00000008)
#define IOMUX_PINCM35_PF_UC6_RTS                      ((uint32_t)0X00000008)
#define IOMUX_PINCM35_PF_UC5_TX                       ((uint32_t)0X00000009)

/* IOMUX_PINCM36[PF] Bits */
#define IOMUX_PINCM36_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM36_PF_GPIOA_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM36_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000002)
#define IOMUX_PINCM36_PF_TIMA0_1_CCP1_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM36_PF_TIMA0_0_CCP3                 ((uint32_t)0X00000004)
#define IOMUX_PINCM36_PF_I2S0_AD1                     ((uint32_t)0X00000005)
#define IOMUX_PINCM36_PF_QSPI_POCI                    ((uint32_t)0X00000006)
#define IOMUX_PINCM36_PF_UC0_CTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM36_PF_UC6_PICO                     ((uint32_t)0X00000008)
#define IOMUX_PINCM36_PF_UC6_SDA                      ((uint32_t)0X00000008)
#define IOMUX_PINCM36_PF_UC6_TX                       ((uint32_t)0X00000008)
#define IOMUX_PINCM36_PF_UC5_RX                       ((uint32_t)0X00000009)

/* IOMUX_PINCM37[PF] Bits */
#define IOMUX_PINCM37_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM37_PF_GPIOA_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM37_PF_TIMG8_0_IDX                  ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_TIMA0_0_CCP2                 ((uint32_t)0X00000003)
#define IOMUX_PINCM37_PF_UC1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM37_PF_UC1_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM37_PF_UC4_SCL                      ((uint32_t)0X00000006)
#define IOMUX_PINCM37_PF_UC0_RTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM37_PF_I2S0_WCLK                    ((uint32_t)0X00000008)

/* IOMUX_PINCM38[PF] Bits */
#define IOMUX_PINCM38_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM38_PF_GPIOA_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM38_PF_TIMA0_0_CCP2_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM38_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000003)
#define IOMUX_PINCM38_PF_UC1_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM38_PF_UC1_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM38_PF_UC6_POCI                     ((uint32_t)0X00000005)
#define IOMUX_PINCM38_PF_UC6_RTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM38_PF_UC4_SDA                      ((uint32_t)0X00000006)
#define IOMUX_PINCM38_PF_QSPI_CS3_CD_POCI3            ((uint32_t)0X00000007)

/* IOMUX_PINCM39[PF] Bits */
#define IOMUX_PINCM39_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM39_PF_GPIOA_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM39_PF_TIMG4_3_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM39_PF_TIMA0_0_CCP3                 ((uint32_t)0X00000003)
#define IOMUX_PINCM39_PF_UC1_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM39_PF_UC1_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM39_PF_UC6_SCLK                     ((uint32_t)0X00000005)
#define IOMUX_PINCM39_PF_UC6_SCL                      ((uint32_t)0X00000005)
#define IOMUX_PINCM39_PF_UC6_RX                       ((uint32_t)0X00000005)

/* IOMUX_PINCM40[PF] Bits */
#define IOMUX_PINCM40_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM40_PF_GPIOA_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM40_PF_TIMA0_0_CCP3_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_I2S0_WCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM40_PF_UC1_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM40_PF_UC1_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM40_PF_UC6_PICO                     ((uint32_t)0X00000005)
#define IOMUX_PINCM40_PF_UC6_SDA                      ((uint32_t)0X00000005)
#define IOMUX_PINCM40_PF_UC6_TX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM40_PF_UC7_CS0                      ((uint32_t)0X00000006)
#define IOMUX_PINCM40_PF_UC7_CTS                      ((uint32_t)0X00000006)
#define IOMUX_PINCM40_PF_QSPI_CS1_POCI1               ((uint32_t)0X00000007)

/* IOMUX_PINCM41[PF] Bits */
#define IOMUX_PINCM41_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM41_PF_GPIOA_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM41_PF_DEBUGSS_SWDIO                ((uint32_t)0X00000002)
#define IOMUX_PINCM41_PF_UC3_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM41_PF_UC5_TX                       ((uint32_t)0X00000004)

