TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/* IOMUX_PINCM42[PF] Bits */
#define IOMUX_PINCM42_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM42_PF_GPIOA_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM42_PF_DEBUGSS_SWCLK                ((uint32_t)0X00000002)
#define IOMUX_PINCM42_PF_UC3_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_UC5_RX                       ((uint32_t)0X00000004)

/* IOMUX_PINCM43[PF] Bits */
#define IOMUX_PINCM43_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM43_PF_GPIOB_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM43_PF_TIMA0_0_CCP2                 ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_UC7_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_UC7_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_UC7_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_UC2_PICO                     ((uint32_t)0X00000004)

/* IOMUX_PINCM44[PF] Bits */
#define IOMUX_PINCM44_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM44_PF_GPIOB_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM44_PF_TIMA0_0_CCP2_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_UC7_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_UC7_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_UC7_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_UC2_SCLK                     ((uint32_t)0X00000004)

/* IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_TIMG4_3_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_TIMA0_1_CCP2                 ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_UC2_POCI                     ((uint32_t)0X00000004)
#define IOMUX_PINCM45_PF_UC0_CTS                      ((uint32_t)0X00000005)

/* IOMUX_PINCM46[PF] Bits */
#define IOMUX_PINCM46_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM46_PF_GPIOA_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM46_PF_TIMG4_2_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM46_PF_TIMA0_0_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM46_PF_I2S0_AD0                     ((uint32_t)0X00000004)
#define IOMUX_PINCM46_PF_UC1_CTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM46_PF_UC7_PICO                     ((uint32_t)0X00000006)
#define IOMUX_PINCM46_PF_UC7_SDA                      ((uint32_t)0X00000006)
#define IOMUX_PINCM46_PF_UC7_TX                       ((uint32_t)0X00000006)
#define IOMUX_PINCM46_PF_UC8_CS0                      ((uint32_t)0X00000007)
#define IOMUX_PINCM46_PF_UC8_CTS                      ((uint32_t)0X00000007)

/* IOMUX_PINCM47[PF] Bits */
#define IOMUX_PINCM47_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM47_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM47_PF_TIMG4_2_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM47_PF_TIMA0_0_CCP0_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM47_PF_I2S0_BCLK                    ((uint32_t)0X00000004)
#define IOMUX_PINCM47_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000005)
#define IOMUX_PINCM47_PF_UC7_SCLK                     ((uint32_t)0X00000006)
#define IOMUX_PINCM47_PF_UC7_SCL                      ((uint32_t)0X00000006)
#define IOMUX_PINCM47_PF_UC7_RX                       ((uint32_t)0X00000006)
#define IOMUX_PINCM47_PF_UC8_POCI                     ((uint32_t)0X00000007)
#define IOMUX_PINCM47_PF_UC8_RTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM47_PF_UC1_RTS                      ((uint32_t)0X00000008)
#define IOMUX_PINCM47_PF_DFTSS_TDI                    ((uint32_t)0X00000009)

/* IOMUX_PINCM48[PF] Bits */
#define IOMUX_PINCM48_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM48_PF_GPIOB_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM48_PF_TIMG12_0_CCP0                ((uint32_t)0X00000002)
#define IOMUX_PINCM48_PF_TIMA0_0_CCP1                 ((uint32_t)0X00000003)
#define IOMUX_PINCM48_PF_TIMA0_1_CCP2_CMPL            ((uint32_t)0X00000004)
#define IOMUX_PINCM48_PF_I2S1_AD0                     ((uint32_t)0X00000005)
#define IOMUX_PINCM48_PF_UC2_CS2                      ((uint32_t)0X00000006)

/* IOMUX_PINCM49[PF] Bits */
#define IOMUX_PINCM49_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM49_PF_GPIOB_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM49_PF_TIMG8_0_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM49_PF_CANFD1_CANTX                 ((uint32_t)0X00000003)
#define IOMUX_PINCM49_PF_TIMA0_1_CCP3                 ((uint32_t)0X00000004)
#define IOMUX_PINCM49_PF_I2S1_AD1                     ((uint32_t)0X00000005)
#define IOMUX_PINCM49_PF_UC10_SCL                     ((uint32_t)0X00000006)
#define IOMUX_PINCM49_PF_UC10_RX                      ((uint32_t)0X00000006)

/* IOMUX_PINCM50[PF] Bits */
#define IOMUX_PINCM50_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM50_PF_GPIOB_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM50_PF_TIMG8_0_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM50_PF_CANFD1_CANRX                 ((uint32_t)0X00000003)
#define IOMUX_PINCM50_PF_TIMA0_1_CCP3_CMPL            ((uint32_t)0X00000004)
#define IOMUX_PINCM50_PF_I2S1_WCLK                    ((uint32_t)0X00000005)
#define IOMUX_PINCM50_PF_UC10_SDA                     ((uint32_t)0X00000006)
#define IOMUX_PINCM50_PF_UC10_TX                      ((uint32_t)0X00000006)
#define IOMUX_PINCM50_PF_UC6_PICO                     ((uint32_t)0X00000007)
#define IOMUX_PINCM50_PF_UC6_SDA                      ((uint32_t)0X00000007)
#define IOMUX_PINCM50_PF_UC6_TX                       ((uint32_t)0X00000007)

