TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/* IOMUX_PINCM51[PF] Bits */
#define IOMUX_PINCM51_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM51_PF_GPIOB_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM51_PF_TIMG4_1_CCP0                 ((uint32_t)0X00000004)
#define IOMUX_PINCM51_PF_I2S1_BCLK                    ((uint32_t)0X00000005)
#define IOMUX_PINCM51_PF_UC10_CTS                     ((uint32_t)0X00000006)
#define IOMUX_PINCM51_PF_UC6_SCLK                     ((uint32_t)0X00000007)
#define IOMUX_PINCM51_PF_UC6_SCL                      ((uint32_t)0X00000007)
#define IOMUX_PINCM51_PF_UC6_RX                       ((uint32_t)0X00000007)

/* IOMUX_PINCM52[PF] Bits */
#define IOMUX_PINCM52_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM52_PF_GPIOB_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM52_PF_TIMG12_0_CCP1                ((uint32_t)0X00000002)
#define IOMUX_PINCM52_PF_TIMA_1_FAULT2                ((uint32_t)0X00000003)
#define IOMUX_PINCM52_PF_TIMG4_1_CCP1                 ((uint32_t)0X00000004)
#define IOMUX_PINCM52_PF_I2S1_MCLK                    ((uint32_t)0X00000005)
#define IOMUX_PINCM52_PF_UC10_RTS                     ((uint32_t)0X00000006)
#define IOMUX_PINCM52_PF_UC2_CS3                      ((uint32_t)0X00000007)

/* IOMUX_PINCM53[PF] Bits */
#define IOMUX_PINCM53_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM53_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM53_PF_TIMA0_0_CCP3                 ((uint32_t)0X00000002)
#define IOMUX_PINCM53_PF_I2S0_WCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM53_PF_UC7_PICO                     ((uint32_t)0X00000004)
#define IOMUX_PINCM53_PF_UC7_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM53_PF_UC7_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM53_PF_UC6_CS0                      ((uint32_t)0X00000005)
#define IOMUX_PINCM53_PF_UC6_CTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM53_PF_UC2_CS3                      ((uint32_t)0X00000006)
#define IOMUX_PINCM53_PF_UC8_SCLK                     ((uint32_t)0X00000007)
#define IOMUX_PINCM53_PF_UC8_SCL                      ((uint32_t)0X00000007)
#define IOMUX_PINCM53_PF_UC8_RX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM53_PF_TIMG4_0_CCP0                 ((uint32_t)0X00000009)

/* IOMUX_PINCM54[PF] Bits */
#define IOMUX_PINCM54_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM54_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM54_PF_TIMA0_0_CCP3_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM54_PF_I2S0_AD1                     ((uint32_t)0X00000003)
#define IOMUX_PINCM54_PF_UC7_SCLK                     ((uint32_t)0X00000004)
#define IOMUX_PINCM54_PF_UC7_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM54_PF_UC7_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM54_PF_UC6_POCI                     ((uint32_t)0X00000005)
#define IOMUX_PINCM54_PF_UC6_RTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM54_PF_UC2_CS2                      ((uint32_t)0X00000006)
#define IOMUX_PINCM54_PF_UC8_PICO                     ((uint32_t)0X00000007)
#define IOMUX_PINCM54_PF_UC8_SDA                      ((uint32_t)0X00000007)
#define IOMUX_PINCM54_PF_UC8_TX                       ((uint32_t)0X00000007)
#define IOMUX_PINCM54_PF_TIMG12_0_CCP1                ((uint32_t)0X00000008)
#define IOMUX_PINCM54_PF_TIMG4_0_CCP1                 ((uint32_t)0X00000009)

/* IOMUX_PINCM55[PF] Bits */
#define IOMUX_PINCM55_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM55_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM55_PF_TIMA0_0_CCP1_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM55_PF_I2S0_AD0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM55_PF_UC6_SCLK                     ((uint32_t)0X00000004)
#define IOMUX_PINCM55_PF_UC6_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM55_PF_UC6_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM55_PF_UC9_SCLK                     ((uint32_t)0X00000005)
#define IOMUX_PINCM55_PF_UC9_SCL                      ((uint32_t)0X00000005)
#define IOMUX_PINCM55_PF_UC9_RX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM55_PF_UC7_POCI                     ((uint32_t)0X00000006)
#define IOMUX_PINCM55_PF_UC7_RTS                      ((uint32_t)0X00000006)

/* IOMUX_PINCM56[PF] Bits */
#define IOMUX_PINCM56_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM56_PF_GPIOB_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM56_PF_TIMA_0_FAULT2                ((uint32_t)0X00000002)
#define IOMUX_PINCM56_PF_I2S0_BCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM56_PF_UC0_CTS                      ((uint32_t)0X00000004)

/* IOMUX_PINCM57[PF] Bits */
#define IOMUX_PINCM57_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM57_PF_GPIOB_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM57_PF_TIMG4_2_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM57_PF_I2S0_MCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM57_PF_UC0_RTS                      ((uint32_t)0X00000004)

/* IOMUX_PINCM58[PF] Bits */
#define IOMUX_PINCM58_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM58_PF_GPIOB_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM58_PF_TIMG4_2_CCP1                 ((uint32_t)0X00000002)

/* IOMUX_PINCM59[PF] Bits */
#define IOMUX_PINCM59_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM59_PF_GPIOA_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM59_PF_TIMG4_3_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM59_PF_TIMA_0_FAULT0                ((uint32_t)0X00000003)
#define IOMUX_PINCM59_PF_CANFD0_CANTX                 ((uint32_t)0X00000004)
#define IOMUX_PINCM59_PF_UC6_PICO                     ((uint32_t)0X00000005)
#define IOMUX_PINCM59_PF_UC6_SDA                      ((uint32_t)0X00000005)
#define IOMUX_PINCM59_PF_UC6_TX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM59_PF_UC6_CS0                      ((uint32_t)0X00000006)
#define IOMUX_PINCM59_PF_UC6_CTS                      ((uint32_t)0X00000006)
#define IOMUX_PINCM59_PF_UC9_PICO                     ((uint32_t)0X00000007)
#define IOMUX_PINCM59_PF_UC9_SDA                      ((uint32_t)0X00000007)
#define IOMUX_PINCM59_PF_UC9_TX                       ((uint32_t)0X00000007)

/* IOMUX_PINCM60[PF] Bits */
#define IOMUX_PINCM60_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM60_PF_GPIOA_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM60_PF_TIMG4_3_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM60_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000003)
#define IOMUX_PINCM60_PF_CANFD0_CANRX                 ((uint32_t)0X00000004)
#define IOMUX_PINCM60_PF_TIMG4_1_CCP0                 ((uint32_t)0X00000005)
#define IOMUX_PINCM60_PF_TIMA_0_FAULT2                ((uint32_t)0X00000006)
#define IOMUX_PINCM60_PF_UC9_POCI                     ((uint32_t)0X00000007)
#define IOMUX_PINCM60_PF_UC9_RTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM60_PF_UC2_CS1                      ((uint32_t)0X00000008)

/* IOMUX_PINCM61[PF] Bits */
#define IOMUX_PINCM61_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM61_PF_GPIOC_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM61_PF_TIMA0_1_CCP0                 ((uint32_t)0X00000002)

/* IOMUX_PINCM62[PF] Bits */
#define IOMUX_PINCM62_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM62_PF_GPIOC_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM62_PF_TIMG4_1_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM62_PF_UC7_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM62_PF_UC7_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM62_PF_UC7_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM62_PF_UC5_RTS                      ((uint32_t)0X00000004)

