TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/* IOMUX_PINCM63[PF] Bits */
#define IOMUX_PINCM63_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM63_PF_GPIOC_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM63_PF_TIMG4_1_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM63_PF_UC7_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM63_PF_UC7_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM63_PF_UC7_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM63_PF_UC5_CTS                      ((uint32_t)0X00000004)

/* IOMUX_PINCM64[PF] Bits */
#define IOMUX_PINCM64_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM64_PF_GPIOC_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM64_PF_TIMA0_1_CCP0_CMPL            ((uint32_t)0X00000002)

/* IOMUX_PINCM65[PF] Bits */
#define IOMUX_PINCM65_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM65_PF_GPIOB_DIO28                  ((uint32_t)0X00000001)
#define IOMUX_PINCM65_PF_TIMA0_0_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM65_PF_UC9_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM65_PF_UC9_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM65_PF_UC9_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM65_PF_UC6_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM65_PF_UC6_CTS                      ((uint32_t)0X00000004)

/* IOMUX_PINCM66[PF] Bits */
#define IOMUX_PINCM66_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM66_PF_GPIOB_DIO29                  ((uint32_t)0X00000001)
#define IOMUX_PINCM66_PF_TIMA0_0_CCP0_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM66_PF_TIMG8_1_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM66_PF_UC9_PICO                     ((uint32_t)0X00000004)
#define IOMUX_PINCM66_PF_UC9_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM66_PF_UC9_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM66_PF_UC6_POCI                     ((uint32_t)0X00000005)
#define IOMUX_PINCM66_PF_UC6_RTS                      ((uint32_t)0X00000005)

/* IOMUX_PINCM67[PF] Bits */
#define IOMUX_PINCM67_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM67_PF_GPIOB_DIO30                  ((uint32_t)0X00000001)
#define IOMUX_PINCM67_PF_TIMA0_0_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM67_PF_TIMG8_1_CCP1                 ((uint32_t)0X00000003)
#define IOMUX_PINCM67_PF_UC9_CS0                      ((uint32_t)0X00000004)
#define IOMUX_PINCM67_PF_UC9_CTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM67_PF_UC6_PICO                     ((uint32_t)0X00000005)
#define IOMUX_PINCM67_PF_UC6_SDA                      ((uint32_t)0X00000005)
#define IOMUX_PINCM67_PF_UC6_TX                       ((uint32_t)0X00000005)

/* IOMUX_PINCM68[PF] Bits */
#define IOMUX_PINCM68_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM68_PF_GPIOB_DIO31                  ((uint32_t)0X00000001)
#define IOMUX_PINCM68_PF_TIMG8_0_IDX                  ((uint32_t)0X00000002)
#define IOMUX_PINCM68_PF_TIMA0_0_CCP1_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM68_PF_UC9_POCI                     ((uint32_t)0X00000004)
#define IOMUX_PINCM68_PF_UC9_RTS                      ((uint32_t)0X00000004)
#define IOMUX_PINCM68_PF_UC6_SCLK                     ((uint32_t)0X00000005)
#define IOMUX_PINCM68_PF_UC6_SCL                      ((uint32_t)0X00000005)
#define IOMUX_PINCM68_PF_UC6_RX                       ((uint32_t)0X00000005)
#define IOMUX_PINCM68_PF_TIMG8_1_IDX                  ((uint32_t)0X00000006)

/* IOMUX_PINCM69[PF] Bits */
#define IOMUX_PINCM69_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM69_PF_GPIOC_DIO16                  ((uint32_t)0X00000001)

/* IOMUX_PINCM70[PF] Bits */
#define IOMUX_PINCM70_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM70_PF_GPIOC_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM70_PF_TIMA0_1_CCP1                 ((uint32_t)0X00000002)

/* IOMUX_PINCM71[PF] Bits */
#define IOMUX_PINCM71_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM71_PF_GPIOC_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM71_PF_TIMA0_1_CCP3                 ((uint32_t)0X00000002)

/* IOMUX_PINCM72[PF] Bits */
#define IOMUX_PINCM72_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM72_PF_GPIOC_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM72_PF_TIMA0_1_CCP3_CMPL            ((uint32_t)0X00000002)

/* IOMUX_PINCM73[PF] Bits */
#define IOMUX_PINCM73_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM73_PF_GPIOC_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM73_PF_TIMA_1_FAULT2                ((uint32_t)0X00000002)

/* IOMUX_PINCM74[PF] Bits */
#define IOMUX_PINCM74_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM74_PF_GPIOC_DIO00                  ((uint32_t)0X00000001)
#define IOMUX_PINCM74_PF_TIMG8_0_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM74_PF_TIMA0_0_CCP2                 ((uint32_t)0X00000003)
#define IOMUX_PINCM74_PF_QSPI_CS0                     ((uint32_t)0X00000007)

/* IOMUX_PINCM75[PF] Bits */
#define IOMUX_PINCM75_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM75_PF_GPIOC_DIO01                  ((uint32_t)0X00000001)
#define IOMUX_PINCM75_PF_TIMG8_0_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM75_PF_TIMA0_0_CCP2_CMPL            ((uint32_t)0X00000003)

/* IOMUX_PINCM76[PF] Bits */
#define IOMUX_PINCM76_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM76_PF_GPIOC_DIO02                  ((uint32_t)0X00000001)
#define IOMUX_PINCM76_PF_TIMA0_0_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM76_PF_TIMA_1_FAULT0                ((uint32_t)0X00000003)
#define IOMUX_PINCM76_PF_UC6_SCLK                     ((uint32_t)0X00000004)
#define IOMUX_PINCM76_PF_UC6_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM76_PF_UC6_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM76_PF_TIMG4_1_CCP1                 ((uint32_t)0X00000005)
#define IOMUX_PINCM76_PF_UC6_CS0                      ((uint32_t)0X00000006)
#define IOMUX_PINCM76_PF_UC6_CTS                      ((uint32_t)0X00000006)
#define IOMUX_PINCM76_PF_UC9_CS0                      ((uint32_t)0X00000007)
#define IOMUX_PINCM76_PF_UC9_CTS                      ((uint32_t)0X00000007)
#define IOMUX_PINCM76_PF_UC2_CS0                      ((uint32_t)0X00000008)

