TexasInstruments/msp-zephyr/samples/basic/blinky/src/mspm33c321x.h
/* IOMUX_PINCM77[PF] Bits */
#define IOMUX_PINCM77_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM77_PF_GPIOC_DIO03                  ((uint32_t)0X00000001)
#define IOMUX_PINCM77_PF_TIMG4_3_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM77_PF_TIMA0_0_CCP0_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM77_PF_UC6_PICO                     ((uint32_t)0X00000004)
#define IOMUX_PINCM77_PF_UC6_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM77_PF_UC6_TX                       ((uint32_t)0X00000004)

/* IOMUX_PINCM78[PF] Bits */
#define IOMUX_PINCM78_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM78_PF_GPIOC_DIO04                  ((uint32_t)0X00000001)
#define IOMUX_PINCM78_PF_TIMA0_0_CCP1                 ((uint32_t)0X00000002)

/* IOMUX_PINCM79[PF] Bits */
#define IOMUX_PINCM79_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM79_PF_GPIOC_DIO05                  ((uint32_t)0X00000001)
#define IOMUX_PINCM79_PF_TIMA0_0_CCP1_CMPL            ((uint32_t)0X00000002)

/* IOMUX_PINCM80[PF] Bits */
#define IOMUX_PINCM80_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM80_PF_GPIOC_DIO21                  ((uint32_t)0X00000001)
#define IOMUX_PINCM80_PF_CANFD1_CANTX                 ((uint32_t)0X00000002)

/* IOMUX_PINCM81[PF] Bits */
#define IOMUX_PINCM81_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM81_PF_GPIOC_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM81_PF_CANFD1_CANRX                 ((uint32_t)0X00000002)

/* IOMUX_PINCM82[PF] Bits */
#define IOMUX_PINCM82_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM82_PF_GPIOC_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM82_PF_TIMA0_1_CCP2                 ((uint32_t)0X00000002)

/* IOMUX_PINCM83[PF] Bits */
#define IOMUX_PINCM83_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM83_PF_GPIOC_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM83_PF_TIMA0_1_CCP2_CMPL            ((uint32_t)0X00000002)

/* IOMUX_PINCM84[PF] Bits */
#define IOMUX_PINCM84_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM84_PF_GPIOC_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM84_PF_TIMG4_2_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM84_PF_TIMA0_0_CCP0                 ((uint32_t)0X00000003)
#define IOMUX_PINCM84_PF_UC6_PICO                     ((uint32_t)0X00000004)
#define IOMUX_PINCM84_PF_UC6_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM84_PF_UC6_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM84_PF_UC2_CS1                      ((uint32_t)0X00000005)

/* IOMUX_PINCM85[PF] Bits */
#define IOMUX_PINCM85_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM85_PF_GPIOC_DIO07                  ((uint32_t)0X00000001)
#define IOMUX_PINCM85_PF_TIMG4_2_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM85_PF_TIMA0_0_CCP0_CMPL            ((uint32_t)0X00000003)
#define IOMUX_PINCM85_PF_UC6_SCLK                     ((uint32_t)0X00000004)
#define IOMUX_PINCM85_PF_UC6_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM85_PF_UC6_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM85_PF_UC2_CS0                      ((uint32_t)0X00000005)

/* IOMUX_PINCM86[PF] Bits */
#define IOMUX_PINCM86_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM86_PF_GPIOC_DIO08                  ((uint32_t)0X00000001)
#define IOMUX_PINCM86_PF_TIMA0_0_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM86_PF_UC6_CS0                      ((uint32_t)0X00000003)
#define IOMUX_PINCM86_PF_UC6_CTS                      ((uint32_t)0X00000003)

/* IOMUX_PINCM87[PF] Bits */
#define IOMUX_PINCM87_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM87_PF_GPIOC_DIO09                  ((uint32_t)0X00000001)
#define IOMUX_PINCM87_PF_TIMA0_0_CCP1_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM87_PF_UC6_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM87_PF_UC6_RTS                      ((uint32_t)0X00000003)

/* IOMUX_PINCM88[PF] Bits */
#define IOMUX_PINCM88_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM88_PF_GPIOC_DIO10                  ((uint32_t)0X00000001)
#define IOMUX_PINCM88_PF_TIMG8_1_CCP0                 ((uint32_t)0X00000002)
#define IOMUX_PINCM88_PF_UC10_SCL                     ((uint32_t)0X00000003)
#define IOMUX_PINCM88_PF_UC10_RX                      ((uint32_t)0X00000003)

/* IOMUX_PINCM89[PF] Bits */
#define IOMUX_PINCM89_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM89_PF_GPIOC_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM89_PF_TIMG8_1_CCP1                 ((uint32_t)0X00000002)
#define IOMUX_PINCM89_PF_UC10_SDA                     ((uint32_t)0X00000003)
#define IOMUX_PINCM89_PF_UC10_TX                      ((uint32_t)0X00000003)

/* IOMUX_PINCM90[PF] Bits */
#define IOMUX_PINCM90_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM90_PF_GPIOC_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM90_PF_TIMG8_1_IDX                  ((uint32_t)0X00000002)
#define IOMUX_PINCM90_PF_UC10_CTS                     ((uint32_t)0X00000003)

/* IOMUX_PINCM91[PF] Bits */
#define IOMUX_PINCM91_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM91_PF_GPIOC_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM91_PF_CANFD1_CANTX                 ((uint32_t)0X00000002)
#define IOMUX_PINCM91_PF_UC10_RTS                     ((uint32_t)0X00000003)

/* IOMUX_PINCM92[PF] Bits */
#define IOMUX_PINCM92_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM92_PF_GPIOC_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM92_PF_CANFD1_CANRX                 ((uint32_t)0X00000002)

/* IOMUX_PINCM93[PF] Bits */
#define IOMUX_PINCM93_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM93_PF_GPIOC_DIO28                  ((uint32_t)0X00000001)
#define IOMUX_PINCM93_PF_UC9_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM93_PF_UC9_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM93_PF_UC9_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM93_PF_UC5_TX                       ((uint32_t)0X00000004)

/* IOMUX_PINCM94[PF] Bits */
#define IOMUX_PINCM94_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM94_PF_GPIOC_DIO29                  ((uint32_t)0X00000001)
#define IOMUX_PINCM94_PF_TIMA0_1_CCP1_CMPL            ((uint32_t)0X00000002)
#define IOMUX_PINCM94_PF_UC9_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM94_PF_UC9_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM94_PF_UC9_TX                       ((uint32_t)0X00000003)

#if defined(__CC_ARM)
#pragma pop
#elif defined(__ICCARM__)
/* leave anonymous unions enabled */
#elif(defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
#pragma clang diagnostic pop
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
#pragma warning restore
#elif defined(__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/*@}*/ /* end of group M33C1_PeripheralDecl */

/*@}*/ /* end of group M33C1_Definitions */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_m0p_m33c1__include */
